apache/nuttx/arch/arm/src/efm32/efm32_usbdev.c
/****************************************************************************
 * arch/arm/src/efm32/efm32_usbdev.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/param.h>
#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbdev.h>
#include <nuttx/usb/usbdev_trace.h>

#include <nuttx/irq.h>
#include <arch/board/board.h>

#include "chip.h"
#include "arm_internal.h"
#include "hardware/efm32_cmu.h"

#include "efm32_usb.h"

#if defined(CONFIG_USBDEV) && (defined(CONFIG_EFM32_OTGFS))

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

#ifndef CONFIG_USBDEV_EP0_MAXSIZE
#  define CONFIG_USBDEV_EP0_MAXSIZE 64
#endif

#ifndef CONFIG_USBDEV_SETUP_MAXDATASIZE
#  define CONFIG_USBDEV_SETUP_MAXDATASIZE CONFIG_USBDEV_EP0_MAXSIZE
#endif

#ifndef CONFIG_USBDEV_MAXPOWER
#  define CONFIG_USBDEV_MAXPOWER 100  /* mA */
#endif

/* There is 1.25Kb of FIFO memory.  The default partitions this memory
 * so that there is a TxFIFO allocated for each endpoint and with more
 * memory provided for the common RxFIFO.  A more knowledge-able
 * configuration would not allocate any TxFIFO space to OUT endpoints.
 */

#ifndef CONFIG_USBDEV_RXFIFO_SIZE
#  define CONFIG_USBDEV_RXFIFO_SIZE 512
#endif

#ifndef CONFIG_USBDEV_EP0_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP0_TXFIFO_SIZE 192
#endif

#ifndef CONFIG_USBDEV_EP1_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP1_TXFIFO_SIZE 192
#endif

#ifndef CONFIG_USBDEV_EP2_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP2_TXFIFO_SIZE 192
#endif

#ifndef CONFIG_USBDEV_EP3_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP3_TXFIFO_SIZE 192
#endif

#if (CONFIG_USBDEV_RXFIFO_SIZE + CONFIG_USBDEV_EP0_TXFIFO_SIZE + \
     CONFIG_USBDEV_EP2_TXFIFO_SIZE + CONFIG_USBDEV_EP3_TXFIFO_SIZE) > 1280
#  error "FIFO allocations exceed FIFO memory size"
#endif

#ifndef CONFIG_DEBUG_USB_INFO
#  undef CONFIG_EFM32_USBDEV_REGDEBUG
#endif

/* The actual FIFO addresses that we use must be aligned to 4-byte
 * boundaries; FIFO sizes must be provided in units of 32-bit words.
 */

#define EFM32_RXFIFO_BYTES     ((CONFIG_USBDEV_RXFIFO_SIZE + 3) & ~3)
#define EFM32_RXFIFO_WORDS     ((CONFIG_USBDEV_RXFIFO_SIZE + 3) >> 2)

#define EFM32_EP0_TXFIFO_BYTES ((CONFIG_USBDEV_EP0_TXFIFO_SIZE + 3) & ~3)
#define EFM32_EP0_TXFIFO_WORDS ((CONFIG_USBDEV_EP0_TXFIFO_SIZE + 3) >> 2)

#if EFM32_EP0_TXFIFO_WORDS < 16 || EFM32_EP0_TXFIFO_WORDS > 256
#  error "CONFIG_USBDEV_EP0_TXFIFO_SIZE is out of range"
#endif

#define EFM32_EP1_TXFIFO_BYTES ((CONFIG_USBDEV_EP1_TXFIFO_SIZE + 3) & ~3)
#define EFM32_EP1_TXFIFO_WORDS ((CONFIG_USBDEV_EP1_TXFIFO_SIZE + 3) >> 2)

#if EFM32_EP1_TXFIFO_WORDS < 16
#  error "CONFIG_USBDEV_EP1_TXFIFO_SIZE is out of range"
#endif

#define EFM32_EP2_TXFIFO_BYTES ((CONFIG_USBDEV_EP2_TXFIFO_SIZE + 3) & ~3)
#define EFM32_EP2_TXFIFO_WORDS ((CONFIG_USBDEV_EP2_TXFIFO_SIZE + 3) >> 2)

#if EFM32_EP2_TXFIFO_WORDS < 16
#  error "CONFIG_USBDEV_EP2_TXFIFO_SIZE is out of range"
#endif

#define EFM32_EP3_TXFIFO_BYTES ((CONFIG_USBDEV_EP3_TXFIFO_SIZE + 3) & ~3)
#define EFM32_EP3_TXFIFO_WORDS ((CONFIG_USBDEV_EP3_TXFIFO_SIZE + 3) >> 2)

#if EFM32_EP3_TXFIFO_WORDS < 16
#  error "CONFIG_USBDEV_EP3_TXFIFO_SIZE is out of range"
#endif

/* Debug ********************************************************************/

/* Trace error codes */

#define EFM32_TRACEERR_ALLOCFAIL            0x01
#define EFM32_TRACEERR_BADCLEARFEATURE      0x02
#define EFM32_TRACEERR_BADDEVGETSTATUS      0x03
#define EFM32_TRACEERR_BADEPNO              0x04
#define EFM32_TRACEERR_BADEPGETSTATUS       0x05
#define EFM32_TRACEERR_BADGETCONFIG         0x06
#define EFM32_TRACEERR_BADGETSETDESC        0x07
#define EFM32_TRACEERR_BADGETSTATUS         0x08
#define EFM32_TRACEERR_BADSETADDRESS        0x09
#define EFM32_TRACEERR_BADSETCONFIG         0x0a
#define EFM32_TRACEERR_BADSETFEATURE        0x0b
#define EFM32_TRACEERR_BADTESTMODE          0x0c
#define EFM32_TRACEERR_BINDFAILED           0x0d
#define EFM32_TRACEERR_DISPATCHSTALL        0x0e
#define EFM32_TRACEERR_DRIVER               0x0f
#define EFM32_TRACEERR_DRIVERREGISTERED     0x10
#define EFM32_TRACEERR_EP0NOSETUP           0x11
#define EFM32_TRACEERR_EP0SETUPSTALLED      0x12
#define EFM32_TRACEERR_EPINNULLPACKET       0x13
#define EFM32_TRACEERR_EPINUNEXPECTED       0x14
#define EFM32_TRACEERR_EPOUTNULLPACKET      0x15
#define EFM32_TRACEERR_EPOUTUNEXPECTED      0x16
#define EFM32_TRACEERR_INVALIDCTRLREQ       0x17
#define EFM32_TRACEERR_INVALIDPARMS         0x18
#define EFM32_TRACEERR_IRQREGISTRATION      0x19
#define EFM32_TRACEERR_NOEP                 0x1a
#define EFM32_TRACEERR_NOTCONFIGURED        0x1b
#define EFM32_TRACEERR_EPOUTQEMPTY          0x1c
#define EFM32_TRACEERR_EPINREQEMPTY         0x1d
#define EFM32_TRACEERR_NOOUTSETUP           0x1e
#define EFM32_TRACEERR_POLLTIMEOUT          0x1f

/* Trace interrupt codes */

