apache/nuttx/arch/arm/src/efm32/efm32_usbdev.c
#define EFM32_TRACEINTID_USB                1       /* USB Interrupt entry/exit */
#define EFM32_TRACEINTID_INTPENDING         2       /* On each pass through the loop */

#define EFM32_TRACEINTID_EPOUT              (10 + 0) /* First level interrupt decode */
#define EFM32_TRACEINTID_EPIN               (10 + 1)
#define EFM32_TRACEINTID_MISMATCH           (10 + 2)
#define EFM32_TRACEINTID_WAKEUP             (10 + 3)
#define EFM32_TRACEINTID_SUSPEND            (10 + 4)
#define EFM32_TRACEINTID_SOF                (10 + 5)
#define EFM32_TRACEINTID_RXFIFO             (10 + 6)
#define EFM32_TRACEINTID_DEVRESET           (10 + 7)
#define EFM32_TRACEINTID_ENUMDNE            (10 + 8)
#define EFM32_TRACEINTID_IISOIXFR           (10 + 9)
#define EFM32_TRACEINTID_IISOOXFR           (10 + 10)
#define EFM32_TRACEINTID_SRQ                (10 + 11)
#define EFM32_TRACEINTID_OTG                (10 + 12)

#define EFM32_TRACEINTID_EPOUT_XFRC         (40 + 0) /* EPOUT second level decode */
#define EFM32_TRACEINTID_EPOUT_EPDISD       (40 + 1)
#define EFM32_TRACEINTID_EPOUT_SETUP        (40 + 2)
#define EFM32_TRACEINTID_DISPATCH           (40 + 3)

#define EFM32_TRACEINTID_GETSTATUS          (50 + 0) /* EPOUT third level decode */
#define EFM32_TRACEINTID_EPGETSTATUS        (50 + 1)
#define EFM32_TRACEINTID_DEVGETSTATUS       (50 + 2)
#define EFM32_TRACEINTID_IFGETSTATUS        (50 + 3)
#define EFM32_TRACEINTID_CLEARFEATURE       (50 + 4)
#define EFM32_TRACEINTID_SETFEATURE         (50 + 5)
#define EFM32_TRACEINTID_SETADDRESS         (50 + 6)
#define EFM32_TRACEINTID_GETSETDESC         (50 + 7)
#define EFM32_TRACEINTID_GETCONFIG          (50 + 8)
#define EFM32_TRACEINTID_SETCONFIG          (50 + 9)
#define EFM32_TRACEINTID_GETSETIF           (50 + 10)
#define EFM32_TRACEINTID_SYNCHFRAME         (50 + 11)

#define EFM32_TRACEINTID_EPIN_XFRC          (70 + 0) /* EPIN second level decode */
#define EFM32_TRACEINTID_EPIN_TOC           (70 + 1)
#define EFM32_TRACEINTID_EPIN_ITTXFE        (70 + 2)
#define EFM32_TRACEINTID_EPIN_EPDISD        (70 + 3)
#define EFM32_TRACEINTID_EPIN_TXFE          (70 + 4)

#define EFM32_TRACEINTID_EPIN_EMPWAIT       (80 + 0) /* EPIN second level decode */

#define EFM32_TRACEINTID_OUTNAK             (90 + 0) /* RXFLVL second level decode */
#define EFM32_TRACEINTID_OUTRECVD           (90 + 1)
#define EFM32_TRACEINTID_OUTDONE            (90 + 2)
#define EFM32_TRACEINTID_SETUPDONE          (90 + 3)
#define EFM32_TRACEINTID_SETUPRECVD         (90 + 4)

/* Endpoints ****************************************************************/

/* Number of endpoints */

#define EFM32_NENDPOINTS             (7)          /* ep0-6 x 2 for IN and OUT */

/* Odd physical endpoint numbers are IN; even are OUT */

#define EFM32_EPPHYIN2LOG(epphy)     ((uint8_t)(epphy)|USB_DIR_IN)
#define EFM32_EPPHYOUT2LOG(epphy)    ((uint8_t)(epphy)|USB_DIR_OUT)

/* Endpoint 0 */

#define EP0                          (0)

/* The set of all endpoints available to the class implementation (1-3) */

#define EFM32_EP_AVAILABLE           (0x0e)       /* All available endpoints */

/* Maximum packet sizes for full speed endpoints */

#define EFM32_MAXPACKET              (64)         /* Max packet size (1-64) */

/* Delays *******************************************************************/

#define EFM32_READY_DELAY            200000
#define EFM32_FLUSH_DELAY            200000

/* Request queue operations *************************************************/

#define efm32_rqempty(ep)            ((ep)->head == NULL)
#define efm32_rqpeek(ep)             ((ep)->head)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Overall device state */

enum efm32_devstate_e
{
  DEVSTATE_DEFAULT = 0,    /* Power-up, unconfigured state.  This state simply
                            * means that the device is not yet been given an
                            * address.
                            *   SET:    At initialization, uninitialization,
                            *           reset, and whenever the device address
                            *           is set to zero
                            *   TESTED: Never
                            */
  DEVSTATE_ADDRESSED,      /* Device address has been assigned, not no
                            * configuration has yet been selected.
                            *   SET:    When either a non-zero device address
                            *           is first assigned or when the device
                            *           is unconfigured (with configuration == 0)
                            *   TESTED: never
                            */
  DEVSTATE_CONFIGURED,     /* Address assigned and configured:
                            *   SET:    When the device has been addressed and
                            *           an non-zero configuration has been selected.
                            *   TESTED: In many places to assure that the USB device
                            *           has been properly configured by the host.
                            */
};

/* Endpoint 0 states */

enum efm32_ep0state_e
{
  EP0STATE_IDLE = 0,       /* Idle State, leave on receiving a SETUP packet or
                            * epsubmit:
                            *   SET:    In efm32_epin() and efm32_epout() when
                            *           we revert from request processing to
                            *           SETUP processing.
                            *   TESTED: Never
                            */

  EP0STATE_SETUP_OUT,      /* OUT SETUP packet received.  Waiting for the DATA
                            * OUT phase of SETUP Packet to complete before
                            * processing a SETUP command (without a USB request):
                            *   SET:    Set in efm32_rxinterrupt() when SETUP OUT
                            *           packet is received.
                            *   TESTED: In efm32_ep0out_receive()
                            */

