apache/nuttx/arch/arm/src/efm32/efm32_usbdev.c
/* Register operations ******************************************************/

#ifdef CONFIG_EFM32_USBDEV_REGDEBUG
static uint32_t    efm32_getreg(uint32_t addr);
static void        efm32_putreg(uint32_t val, uint32_t addr);
#else
#  define efm32_getreg(addr)     getreg32(addr)
#  define efm32_putreg(val,addr) putreg32(val,addr)
#endif

/* Request queue operations *************************************************/

static struct
efm32_req_s *efm32_req_remfirst(struct efm32_ep_s *privep);
static bool       efm32_req_addlast(struct efm32_ep_s *privep,
                    struct efm32_req_s *req);

/* Low level data transfers and request operations **************************/

/* Special endpoint 0 data transfer logic */

static void        efm32_ep0in_setupresponse(struct efm32_usbdev_s *priv,
                     uint8_t *data, uint32_t nbytes);
static inline void efm32_ep0in_transmitzlp(struct efm32_usbdev_s *priv);
static void        efm32_ep0in_activate(void);

static void        efm32_ep0out_ctrlsetup(struct efm32_usbdev_s *priv);

/* IN request and TxFIFO handling */

static void        efm32_txfifo_write(struct efm32_ep_s *privep,
                     uint8_t *buf, int nbytes);
static void        efm32_epin_transfer(struct efm32_ep_s *privep,
                     uint8_t *buf, int nbytes);
static void        efm32_epin_request(struct efm32_usbdev_s *priv,
                     struct efm32_ep_s *privep);

/* OUT request and RxFIFO handling */

static void        efm32_rxfifo_read(struct efm32_ep_s *privep,
                     uint8_t *dest, uint16_t len);
static void     efm32_rxfifo_discard(struct efm32_ep_s *privep, int len);
static void     efm32_epout_complete(struct efm32_usbdev_s *priv,
                                     struct efm32_ep_s *privep);
static inline void
efm32_ep0out_receive(struct efm32_ep_s *privep, int bcnt);
static inline void
efm32_epout_receive(struct efm32_ep_s *privep, int bcnt);
static void        efm32_epout_request(struct efm32_usbdev_s *priv,
                     struct efm32_ep_s *privep);

/* General request handling */

static void        efm32_ep_flush(struct efm32_ep_s *privep);
static void        efm32_req_complete(struct efm32_ep_s *privep,
                     int16_t result);
static void        efm32_req_cancel(struct efm32_ep_s *privep,
                     int16_t status);

/* Interrupt handling *******************************************************/

static struct    efm32_ep_s *efm32_ep_findbyaddr(struct efm32_usbdev_s *priv,
                     uint16_t eplog);
static int         efm32_req_dispatch(struct efm32_usbdev_s *priv,
                     const struct usb_ctrlreq_s *ctrl);
static void        efm32_usbreset(struct efm32_usbdev_s *priv);

/* Second level OUT endpoint interrupt processing */

static inline void efm32_ep0out_testmode(struct efm32_usbdev_s *priv,
                     uint16_t index);
static inline void efm32_ep0out_stdrequest(struct efm32_usbdev_s *priv,
                     struct efm32_ctrlreq_s *ctrlreq);
static inline void efm32_ep0out_setup(struct efm32_usbdev_s *priv);
static inline void efm32_epout(struct efm32_usbdev_s *priv,
                     uint8_t epno);
static inline void efm32_epout_interrupt(struct efm32_usbdev_s *priv);

/* Second level IN endpoint interrupt processing */

static inline void efm32_epin_runtestmode(struct efm32_usbdev_s *priv);
static inline void efm32_epin(struct efm32_usbdev_s *priv, uint8_t epno);
static inline void efm32_epin_txfifoempty(struct efm32_usbdev_s *priv,
                                          int epno);
static inline void efm32_epin_interrupt(struct efm32_usbdev_s *priv);

/* Other second level interrupt processing */

static inline void efm32_resumeinterrupt(struct efm32_usbdev_s *priv);
static inline void efm32_suspendinterrupt(struct efm32_usbdev_s *priv);
static inline void efm32_rxinterrupt(struct efm32_usbdev_s *priv);
static inline void efm32_enuminterrupt(struct efm32_usbdev_s *priv);
#ifdef CONFIG_USBDEV_ISOCHRONOUS
static inline void efm32_isocininterrupt(struct efm32_usbdev_s *priv);
static inline void efm32_isocoutinterrupt(struct efm32_usbdev_s *priv);
#endif
#ifdef CONFIG_USBDEV_VBUSSENSING
static inline void efm32_sessioninterrupt(struct efm32_usbdev_s *priv);
static inline void efm32_otginterrupt(struct efm32_usbdev_s *priv);
#endif

/* First level interrupt processing */

static int         efm32_usbinterrupt(int irq,
                                      void *context, void *arg);

/* Endpoint operations ******************************************************/

/* Global OUT NAK controls */

static void        efm32_enablegonak(struct efm32_ep_s *privep);
static void        efm32_disablegonak(struct efm32_ep_s *privep);

/* Endpoint configuration */

static int         efm32_epout_configure(struct efm32_ep_s *privep,
                     uint8_t eptype, uint16_t maxpacket);
static int         efm32_epin_configure(struct efm32_ep_s *privep,
                     uint8_t eptype, uint16_t maxpacket);
static int         efm32_ep_configure(struct usbdev_ep_s *ep,
                     const struct usb_epdesc_s *desc, bool last);
static void        efm32_ep0_configure(struct efm32_usbdev_s *priv);

/* Endpoint disable */

static void        efm32_epout_disable(struct efm32_ep_s *privep);
static void        efm32_epin_disable(struct efm32_ep_s *privep);
static int         efm32_ep_disable(struct usbdev_ep_s *ep);

/* Endpoint request management */

static struct
usbdev_req_s *efm32_ep_allocreq(struct usbdev_ep_s *ep);
static void        efm32_ep_freereq(struct usbdev_ep_s *ep,
                     struct usbdev_req_s *);

/* Endpoint buffer management */

#ifdef CONFIG_USBDEV_DMA
static void       *efm32_ep_allocbuffer(struct usbdev_ep_s *ep,
                                        unsigned bytes);
static void        efm32_ep_freebuffer(struct usbdev_ep_s *ep,
                                       void *buf);
#endif

/* Endpoint request submission */

static int         efm32_ep_submit(struct usbdev_ep_s *ep,
                     struct usbdev_req_s *req);

/* Endpoint request cancellation */

static int         efm32_ep_cancel(struct usbdev_ep_s *ep,
                     struct usbdev_req_s *req);

/* Stall handling */

static int         efm32_epout_setstall(struct efm32_ep_s *privep);
static int         efm32_epin_setstall(struct efm32_ep_s *privep);
static int         efm32_ep_setstall(struct efm32_ep_s *privep);
static int         efm32_ep_clrstall(struct efm32_ep_s *privep);
static int         efm32_ep_stall(struct usbdev_ep_s *ep, bool resume);
static void        efm32_ep0_stall(struct efm32_usbdev_s *priv);

