apache/nuttx/arch/arm/src/efm32/efm32_usbdev.c
/* Endpoint allocation */

static struct usbdev_ep_s *efm32_ep_alloc(struct usbdev_s *dev,
                     uint8_t epno, bool in, uint8_t eptype);
static void        efm32_ep_free(struct usbdev_s *dev,
                     struct usbdev_ep_s *ep);

/* USB device controller operations *****************************************/

static int         efm32_getframe(struct usbdev_s *dev);
static int         efm32_wakeup(struct usbdev_s *dev);
static int         efm32_selfpowered(struct usbdev_s *dev, bool selfpowered);
static int         efm32_pullup(struct usbdev_s *dev, bool enable);
static void        efm32_setaddress(struct efm32_usbdev_s *priv,
                     uint16_t address);
static int         efm32_txfifo_flush(uint32_t txfnum);
static int         efm32_rxfifo_flush(void);

/* Initialization ***********************************************************/

static void        efm32_swinitialize(struct efm32_usbdev_s *priv);
static void        efm32_hwinitialize(struct efm32_usbdev_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Since there is only a single USB interface, all status information can be
 * be simply retained in a single global instance.
 */

static struct efm32_usbdev_s g_otgfsdev;

static const struct usbdev_epops_s g_epops =
{
  .configure   = efm32_ep_configure,
  .disable     = efm32_ep_disable,
  .allocreq    = efm32_ep_allocreq,
  .freereq     = efm32_ep_freereq,
#ifdef CONFIG_USBDEV_DMA
  .allocbuffer = efm32_ep_allocbuffer,
  .freebuffer  = efm32_ep_freebuffer,
#endif
  .submit      = efm32_ep_submit,
  .cancel      = efm32_ep_cancel,
  .stall       = efm32_ep_stall,
};

static const struct usbdev_ops_s g_devops =
{
  .allocep     = efm32_ep_alloc,
  .freeep      = efm32_ep_free,
  .getframe    = efm32_getframe,
  .wakeup      = efm32_wakeup,
  .selfpowered = efm32_selfpowered,
  .pullup      = efm32_pullup,
};

/* Device error strings that may be enabled for more descriptive USB trace
 * output.
 */

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_deverror[] =
{
  TRACE_STR(EFM32_TRACEERR_ALLOCFAIL),
  TRACE_STR(EFM32_TRACEERR_BADCLEARFEATURE),
  TRACE_STR(EFM32_TRACEERR_BADDEVGETSTATUS),
  TRACE_STR(EFM32_TRACEERR_BADEPNO),
  TRACE_STR(EFM32_TRACEERR_BADEPGETSTATUS),
  TRACE_STR(EFM32_TRACEERR_BADGETCONFIG),
  TRACE_STR(EFM32_TRACEERR_BADGETSETDESC),
  TRACE_STR(EFM32_TRACEERR_BADGETSTATUS),
  TRACE_STR(EFM32_TRACEERR_BADSETADDRESS),
  TRACE_STR(EFM32_TRACEERR_BADSETCONFIG),
  TRACE_STR(EFM32_TRACEERR_BADSETFEATURE),
  TRACE_STR(EFM32_TRACEERR_BADTESTMODE),
  TRACE_STR(EFM32_TRACEERR_BINDFAILED),
  TRACE_STR(EFM32_TRACEERR_DISPATCHSTALL),
  TRACE_STR(EFM32_TRACEERR_DRIVER),
  TRACE_STR(EFM32_TRACEERR_DRIVERREGISTERED),
  TRACE_STR(EFM32_TRACEERR_EP0NOSETUP),
  TRACE_STR(EFM32_TRACEERR_EP0SETUPSTALLED),
  TRACE_STR(EFM32_TRACEERR_EPINNULLPACKET),
  TRACE_STR(EFM32_TRACEERR_EPINUNEXPECTED),
  TRACE_STR(EFM32_TRACEERR_EPOUTNULLPACKET),
  TRACE_STR(EFM32_TRACEERR_EPOUTUNEXPECTED),
  TRACE_STR(EFM32_TRACEERR_INVALIDCTRLREQ),
  TRACE_STR(EFM32_TRACEERR_INVALIDPARMS),
  TRACE_STR(EFM32_TRACEERR_IRQREGISTRATION),
  TRACE_STR(EFM32_TRACEERR_NOEP),
  TRACE_STR(EFM32_TRACEERR_NOTCONFIGURED),
  TRACE_STR(EFM32_TRACEERR_EPOUTQEMPTY),
  TRACE_STR(EFM32_TRACEERR_EPINREQEMPTY),
  TRACE_STR(EFM32_TRACEERR_NOOUTSETUP),
  TRACE_STR(EFM32_TRACEERR_POLLTIMEOUT),
  TRACE_STR_END
};
#endif

/* Interrupt event strings that may be enabled for more descriptive USB trace
 * output.
 */

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_intdecode[] =
{
  TRACE_STR(EFM32_TRACEINTID_USB),
  TRACE_STR(EFM32_TRACEINTID_INTPENDING),
  TRACE_STR(EFM32_TRACEINTID_EPOUT),
  TRACE_STR(EFM32_TRACEINTID_EPIN),
  TRACE_STR(EFM32_TRACEINTID_MISMATCH),
  TRACE_STR(EFM32_TRACEINTID_WAKEUP),
  TRACE_STR(EFM32_TRACEINTID_SUSPEND),
  TRACE_STR(EFM32_TRACEINTID_SOF),
  TRACE_STR(EFM32_TRACEINTID_RXFIFO),
  TRACE_STR(EFM32_TRACEINTID_DEVRESET),
  TRACE_STR(EFM32_TRACEINTID_ENUMDNE),
  TRACE_STR(EFM32_TRACEINTID_IISOIXFR),
  TRACE_STR(EFM32_TRACEINTID_IISOOXFR),
  TRACE_STR(EFM32_TRACEINTID_SRQ),
  TRACE_STR(EFM32_TRACEINTID_OTG),
  TRACE_STR(EFM32_TRACEINTID_EPOUT_XFRC),
  TRACE_STR(EFM32_TRACEINTID_EPOUT_EPDISD),
  TRACE_STR(EFM32_TRACEINTID_EPOUT_SETUP),
  TRACE_STR(EFM32_TRACEINTID_DISPATCH),
  TRACE_STR(EFM32_TRACEINTID_GETSTATUS),
  TRACE_STR(EFM32_TRACEINTID_EPGETSTATUS),
  TRACE_STR(EFM32_TRACEINTID_DEVGETSTATUS),
  TRACE_STR(EFM32_TRACEINTID_IFGETSTATUS),
  TRACE_STR(EFM32_TRACEINTID_CLEARFEATURE),
  TRACE_STR(EFM32_TRACEINTID_SETFEATURE),
  TRACE_STR(EFM32_TRACEINTID_SETADDRESS),
  TRACE_STR(EFM32_TRACEINTID_GETSETDESC),
  TRACE_STR(EFM32_TRACEINTID_GETCONFIG),
  TRACE_STR(EFM32_TRACEINTID_SETCONFIG),
  TRACE_STR(EFM32_TRACEINTID_GETSETIF),
  TRACE_STR(EFM32_TRACEINTID_SYNCHFRAME),
  TRACE_STR(EFM32_TRACEINTID_EPIN_XFRC),
  TRACE_STR(EFM32_TRACEINTID_EPIN_TOC),
  TRACE_STR(EFM32_TRACEINTID_EPIN_ITTXFE),
  TRACE_STR(EFM32_TRACEINTID_EPIN_EPDISD),
  TRACE_STR(EFM32_TRACEINTID_EPIN_TXFE),
  TRACE_STR(EFM32_TRACEINTID_EPIN_EMPWAIT),
  TRACE_STR(EFM32_TRACEINTID_OUTNAK),
  TRACE_STR(EFM32_TRACEINTID_OUTRECVD),
  TRACE_STR(EFM32_TRACEINTID_OUTDONE),
  TRACE_STR(EFM32_TRACEINTID_SETUPDONE),
  TRACE_STR(EFM32_TRACEINTID_SETUPRECVD),
  TRACE_STR_END
};
#endif

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: efm32_getreg
 *
 * Description:
 *   Get the contents of an EFM32 register
 *
 ****************************************************************************/

#ifdef CONFIG_EFM32_USBDEV_REGDEBUG
static uint32_t efm32_getreg(uint32_t addr)
{
  static uint32_t prevaddr = 0;
  static uint32_t preval = 0;
  static uint32_t count = 0;

  /* Read the value from the register */

  uint32_t val = getreg32(addr);

  /* Is this the same value that we read from the same register last time?
   * Are we polling the register?  If so, suppress some of the output.
   */

  if (addr == prevaddr && val == preval)
    {
      if (count == 0xffffffff || ++count > 3)
        {
          if (count == 4)
            {
              uinfo("...\n");
            }

          return val;
        }
    }

  /* No this is a new address or value */

  else
    {
      /* Did we print "..." for the previous value? */

