apache/nuttx/arch/arm/src/efm32/efm32_usbdev.c
      if (count > 3)
        {
          /* Yes.. then show how many times the value repeated */

          uinfo("[repeats %d more times]\n", count - 3);
        }

      /* Save the new address, value, and count */

      prevaddr = addr;
      preval   = val;
      count    = 1;
    }

  /* Show the register value read */

  uinfo("%08x->%08x\n", addr, val);
  return val;
}
#endif

/****************************************************************************
 * Name: efm32_putreg
 *
 * Description:
 *   Set the contents of an EFM32 register to a value
 *
 ****************************************************************************/

#ifdef CONFIG_EFM32_USBDEV_REGDEBUG
static void efm32_putreg(uint32_t val, uint32_t addr)
{
  /* Show the register value being written */

  uinfo("%08x<-%08x\n", addr, val);

  /* Write the value */

  putreg32(val, addr);
}
#endif

/****************************************************************************
 * Name: efm32_req_remfirst
 *
 * Description:
 *   Remove a request from the head of an endpoint request queue
 *
 ****************************************************************************/

static struct
efm32_req_s *efm32_req_remfirst(struct efm32_ep_s *privep)
{
  struct efm32_req_s *ret = privep->head;

  if (ret)
    {
      privep->head = ret->flink;
      if (!privep->head)
        {
          privep->tail = NULL;
        }

      ret->flink = NULL;
    }

  return ret;
}

/****************************************************************************
 * Name: efm32_req_addlast
 *
 * Description:
 *   Add a request to the end of an endpoint request queue
 *
 ****************************************************************************/

static bool efm32_req_addlast(struct efm32_ep_s *privep,
                              struct efm32_req_s *req)
{
  bool is_empty = !privep->head;

  req->flink = NULL;
  if (is_empty)
    {
      privep->head = req;
      privep->tail = req;
    }
  else
    {
      privep->tail->flink = req;
      privep->tail        = req;
    }

  return is_empty;
}

/****************************************************************************
 * Name: efm32_ep0in_setupresponse
 *
 * Description:
 *   Schedule a short transfer on Endpoint 0 (IN or OUT)
 *
 ****************************************************************************/

static void efm32_ep0in_setupresponse(struct efm32_usbdev_s *priv,
                                      uint8_t *buf, uint32_t nbytes)
{
  efm32_epin_transfer(&priv->epin[EP0], buf, nbytes);
  priv->ep0state = EP0STATE_SETUPRESPONSE;
  efm32_ep0out_ctrlsetup(priv);
}

/****************************************************************************
 * Name: efm32_ep0in_transmitzlp
 *
 * Description:
 *   Send a zero length packet (ZLP) on endpoint 0 IN
 *
 ****************************************************************************/

static inline void efm32_ep0in_transmitzlp(struct efm32_usbdev_s *priv)
{
  efm32_ep0in_setupresponse(priv, NULL, 0);
}

/****************************************************************************
 * Name: efm32_ep0in_activate
 *
 * Description:
 *   Activate the endpoint 0 IN endpoint.
 *
 ****************************************************************************/

static void efm32_ep0in_activate(void)
{
  uint32_t regval;

  /* Set the max packet size  of the IN EP. */

  regval  = efm32_getreg(EFM32_USB_DIEP0CTL);
  regval &= ~_USB_DIEP0CTL_MPS_MASK;

#if CONFIG_USBDEV_EP0_MAXSIZE == 8
  regval |= _USB_DIEP0CTL_MPS_8B;
#elif CONFIG_USBDEV_EP0_MAXSIZE == 16
  regval |= _USB_DIEP0CTL_MPS_16B;
#elif CONFIG_USBDEV_EP0_MAXSIZE == 32
  regval |= _USB_DIEP0CTL_MPS_32B;
#elif CONFIG_USBDEV_EP0_MAXSIZE == 64
  regval |= _USB_DIEP0CTL_MPS_64B;
#else
#  error "Unsupported value of CONFIG_USBDEV_EP0_MAXSIZE"
#endif

  efm32_putreg(regval, EFM32_USB_DIEP0CTL);

  /* Clear global IN NAK */

  regval  = efm32_getreg(EFM32_USB_DCTL);
  regval |= USB_DCTL_CGNPINNAK;
  efm32_putreg(regval, EFM32_USB_DCTL);
}

/****************************************************************************
 * Name: efm32_ep0out_ctrlsetup
 *
 * Description:
 *   Setup to receive a SETUP packet.
 *
 ****************************************************************************/

static void efm32_ep0out_ctrlsetup(struct efm32_usbdev_s *priv)
{
  uint32_t regval;

  /* Setup the hardware to perform the SETUP transfer */

  regval = (USB_SIZEOF_CTRLREQ * 3 << _USB_DOEP0TSIZ_XFERSIZE_SHIFT) |
           (USB_DOEP0TSIZ_PKTCNT) |
           (3 << _USB_DOEP0TSIZ_SUPCNT_SHIFT);
  efm32_putreg(regval, EFM32_USB_DOEP0TSIZ);

  /* Then clear NAKing and enable the transfer */

  regval  = efm32_getreg(EFM32_USB_DOEP0CTL);
  regval |= (USB_DOEP0CTL_CNAK | USB_DOEP0CTL_EPENA);
  efm32_putreg(regval, EFM32_USB_DOEP0CTL);
}

/****************************************************************************
 * Name: efm32_txfifo_write
 *
 * Description:
 *   Send data to the endpoint's TxFIFO.
 *
 ****************************************************************************/

static void efm32_txfifo_write(struct efm32_ep_s *privep,
                               uint8_t *buf, int nbytes)
{
  uint32_t regaddr;
  uint32_t regval;
  int nwords;
  int i;

  /* Convert the number of bytes to words */

  nwords = (nbytes + 3) >> 2;

  /* Get the TxFIFO for this endpoint (same as the endpoint number) */

  regaddr = EFM32_USB_FIFO_BASE(privep->epphy);

  /* Then transfer each word to the TxFIFO */

  for (i = 0; i < nwords; i++)
    {
      /* Read four bytes from the source buffer (to avoid unaligned accesses)
       * and pack these into one 32-bit word (little endian).
       */

      regval  = (uint32_t)*buf++;
      regval |= ((uint32_t)*buf++) << 8;
      regval |= ((uint32_t)*buf++) << 16;
      regval |= ((uint32_t)*buf++) << 24;

      /* Then write the packet data to the TxFIFO */

      efm32_putreg(regval, regaddr);
    }
}

/****************************************************************************
 * Name: efm32_epin_transfer
 *
 * Description:
 *   Start the Tx data transfer
 *
 ****************************************************************************/

