apache/nuttx/arch/arm/src/efm32/efm32_usbdev.c
      for (; ; )
        {
          /* Get a reference to the request at the head of the endpoint's
           * request queue
           */

          privreq = efm32_rqpeek(privep);
          if (!privreq)
            {
              usbtrace(TRACE_DEVERROR(EFM32_TRACEERR_EPOUTQEMPTY),
                       privep->epphy);

              /* There are no read requests to be setup.  Configure the
               * hardware to NAK any incoming packets.  (This should already
               * be the case.  I think that the hardware will automatically
               * NAK after a transfer is completed until SNAK is cleared).
               */

              regaddr = EFM32_USB_DOEPCTL(privep->epphy);
              regval  = efm32_getreg(regaddr);
              regval |= USB_DOEPCTL_SNAK;
              efm32_putreg(regval, regaddr);

              /* This endpoint is no longer actively transferring */

              privep->active = false;
              return;
            }

          uinfo("EP%d: len=%d\n", privep->epphy, privreq->req.len);

          /* Ignore any attempt to receive a zero length packet (this really
           * should not happen.
           */

          if (privreq->req.len <= 0)
            {
              usbtrace(TRACE_DEVERROR(EFM32_TRACEERR_EPOUTNULLPACKET), 0);
              efm32_req_complete(privep, OK);
            }

          /* Otherwise, we have a usable read request...
           * break out of the loop
           */

          else
            {
              break;
            }
        }

      /* Setup the pending read into the request buffer.  First calculate:
       *
       * pktcnt  = the number of packets (of maxpacket bytes) required to
       *   perform the transfer.
       * xfrsize = The total number of bytes required (in units of
       *   maxpacket bytes).
       */

      pktcnt  = (privreq->req.len + (privep->ep.maxpacket - 1)) /
                 privep->ep.maxpacket;
      xfrsize = pktcnt * privep->ep.maxpacket;

      /* Then setup the hardware to perform this transfer */

      regaddr = EFM32_USB_DOEPTSIZ(privep->epphy);
      regval  = efm32_getreg(regaddr);
      regval &= ~(_USB_DOEPTSIZ_XFERSIZE_MASK | _USB_DOEPTSIZ_PKTCNT_MASK);
      regval |= (xfrsize << _USB_DOEPTSIZ_XFERSIZE_SHIFT);
      regval |= (pktcnt  << _USB_DOEPTSIZ_PKTCNT_SHIFT);
      efm32_putreg(regval, regaddr);

      /* Then enable the transfer */

      regaddr = EFM32_USB_DOEPCTL(privep->epphy);
      regval  = efm32_getreg(regaddr);

      /* When an isochronous transfer is enabled the Even/Odd frame bit must
       * also be set appropriately.
       */

#ifdef CONFIG_USBDEV_ISOCHRONOUS
      if (privep->eptype == USB_EP_ATTR_XFER_ISOC)
        {
          if (privep->odd)
            {
              regval |= USB_DOEPCTL_SODDFRM;
            }
          else
            {
              regval |= USB_DOEPCTL_SEVNFRM;
            }
        }
#endif

      /* Clearing NAKing and enable the transfer. */

      regval |= (USB_DOEPCTL_CNAK | USB_DOEPCTL_EPENA);
      efm32_putreg(regval, regaddr);

      /* A transfer is now active on this endpoint */

      privep->active = true;

      /* EP0 is a special case.  We need to know when to switch back to
       * normal SETUP processing.
       */

      if (privep->epphy == EP0)
        {
          priv->ep0state = EP0STATE_DATA_OUT;
        }
    }
}

/****************************************************************************
 * Name: efm32_ep_flush
 *
 * Description:
 *   Flush any primed descriptors from this ep
 *
 ****************************************************************************/

static void efm32_ep_flush(struct efm32_ep_s *privep)
{
  if (privep->isin)
    {
      efm32_txfifo_flush(USB_GRSTCTL_TXFNUM_F(privep->epphy));
    }
  else
    {
      efm32_rxfifo_flush();
    }
}

/****************************************************************************
 * Name: efm32_req_complete
 *
 * Description:
 *   Handle termination of the request at the head of the endpoint request
 *   queue.
 *
 ****************************************************************************/

static void efm32_req_complete(struct efm32_ep_s *privep, int16_t result)
{
  struct efm32_req_s *privreq;

  /* Remove the request at the head of the request list */

  privreq = efm32_req_remfirst(privep);
  DEBUGASSERT(privreq != NULL);

  /* If endpoint 0, temporarily reflect the state of protocol stalled
   * in the callback.
   */

  bool stalled = privep->stalled;
  if (privep->epphy == EP0)
    {
      privep->stalled = privep->dev->stalled;
    }

  /* Save the result in the request structure */

  privreq->req.result = result;

  /* Callback to the request completion handler */

  privreq->req.callback(&privep->ep, &privreq->req);

  /* Restore the stalled indication */

  privep->stalled = stalled;
}

/****************************************************************************
 * Name: efm32_req_cancel
 *
 * Description:
 *   Cancel all pending requests for an endpoint
 *
 ****************************************************************************/

static void efm32_req_cancel(struct efm32_ep_s *privep, int16_t status)
{
  if (!efm32_rqempty(privep))
    {
      efm32_ep_flush(privep);
    }

  while (!efm32_rqempty(privep))
    {
      usbtrace(TRACE_COMPLETE(privep->epphy),
               (efm32_rqpeek(privep))->req.xfrd);
      efm32_req_complete(privep, status);
    }
}

/****************************************************************************
 * Name: efm32_ep_findbyaddr
 *
 * Description:
 *   Find the physical endpoint structure corresponding to a logic endpoint
 *   address
 *
 ****************************************************************************/

static struct efm32_ep_s *efm32_ep_findbyaddr(struct efm32_usbdev_s *priv,
                                              uint16_t eplog)
{
  struct efm32_ep_s *privep;
  uint8_t epphy = USB_EPNO(eplog);

  if (epphy >= EFM32_NENDPOINTS)
    {
      return NULL;
    }

