apache/nuttx/arch/arm/src/efm32/efm32_usbdev.c
  /* Is this an IN or an OUT endpoint? */

  if (USB_ISEPIN(eplog))
    {
      privep = &priv->epin[epphy];
    }
  else
    {
      privep = &priv->epout[epphy];
    }

  /* Return endpoint reference */

  DEBUGASSERT(privep->epphy == epphy);
  return privep;
}

/****************************************************************************
 * Name: efm32_req_dispatch
 *
 * Description:
 *   Provide unhandled setup actions to the class driver. This is logically
 *   part of the USB interrupt handler.
 *
 ****************************************************************************/

static int efm32_req_dispatch(struct efm32_usbdev_s *priv,
                              const struct usb_ctrlreq_s *ctrl)
{
  int ret = -EIO;

  usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_DISPATCH), 0);
  if (priv->driver)
    {
      /* Forward to the control request to the class driver implementation */

      ret = CLASS_SETUP(priv->driver, &priv->usbdev, ctrl,
                        priv->ep0data, priv->ep0datlen);
    }

  if (ret < 0)
    {
      /* Stall on failure */

      usbtrace(TRACE_DEVERROR(EFM32_TRACEERR_DISPATCHSTALL), 0);
      priv->stalled = true;
    }

  return ret;
}

/****************************************************************************
 * Name: efm32_usbreset
 *
 * Description:
 *   Reset Usb engine
 *
 ****************************************************************************/

static void efm32_usbreset(struct efm32_usbdev_s *priv)
{
  struct efm32_ep_s *privep;
  uint32_t regval;
  int i;

  /* Clear the Remote Wake-up Signaling */

  regval = efm32_getreg(EFM32_USB_DCTL);
  regval &= ~USB_DCTL_RMTWKUPSIG;
  efm32_putreg(regval, EFM32_USB_DCTL);

  /* Flush the EP0 Tx FIFO */

  efm32_txfifo_flush(USB_GRSTCTL_TXFNUM_F(EP0));

  /* Tell the class driver that we are disconnected. The class
   * driver should then accept any new configurations.
   */

  if (priv->driver)
    {
      CLASS_DISCONNECT(priv->driver, &priv->usbdev);
    }

  /* Mark all endpoints as available */

  priv->epavail[0] = EFM32_EP_AVAILABLE;
  priv->epavail[1] = EFM32_EP_AVAILABLE;

  /* Disable all end point interrupts */

  for (i = 0; i < EFM32_NENDPOINTS ; i++)
    {
      /* Disable endpoint interrupts */

      efm32_putreg(0xff, EFM32_USB_DIEPINT(i));
      efm32_putreg(0xff, EFM32_USB_DOEPINT(i));

      /* Return write requests to the class implementation */

      privep = &priv->epin[i];
      efm32_req_cancel(privep, -ESHUTDOWN);

      /* Reset IN endpoint status */

      privep->stalled = false;

      /* Return read requests to the class implementation */

      privep = &priv->epout[i];
      efm32_req_cancel(privep, -ESHUTDOWN);

      /* Reset endpoint status */

      privep->stalled = false;
    }

  efm32_putreg(0xffffffff, EFM32_USB_DAINT);

  /* Mask all device endpoint interrupts except EP0 */

  regval = (USB_DAINT_INEPINT(EP0) | USB_DAINT_OUTEPINT(EP0));
  efm32_putreg(regval, EFM32_USB_DAINTMSK);

  /* Unmask OUT interrupts */

  regval = (USB_DOEPMSK_XFERCOMPLMSK | USB_DOEPMSK_SETUPMSK |
            USB_DOEPMSK_EPDISBLDMSK);
  efm32_putreg(regval, EFM32_USB_DOEPMSK);

  /* Unmask IN interrupts */

  regval = (USB_DIEPMSK_XFERCOMPLMSK | USB_DIEPMSK_EPDISBLDMSK |
            USB_DIEPMSK_TIMEOUTMSK);
  efm32_putreg(regval, EFM32_USB_DIEPMSK);

  /* Reset device address to 0 */

  efm32_setaddress(priv, 0);
  priv->devstate = DEVSTATE_DEFAULT;
  priv->usbdev.speed = USB_SPEED_FULL;

  /* Re-configure EP0 */

  efm32_ep0_configure(priv);

  /* Setup EP0 to receive SETUP packets */

  efm32_ep0out_ctrlsetup(priv);
}

/****************************************************************************
 * Name: efm32_ep0out_testmode
 *
 * Description:
 *   Select test mode
 *
 ****************************************************************************/

static inline void efm32_ep0out_testmode(struct efm32_usbdev_s *priv,
                                         uint16_t index)
{
  uint8_t testmode;

  testmode = index >> 8;
  switch (testmode)
    {
    case 1:
      priv->testmode = _USB_DCTL_TSTCTL_J;
      break;

    case 2:
      priv->testmode = _USB_DCTL_TSTCTL_K;
      break;

    case 3:
      priv->testmode = _USB_DCTL_TSTCTL_SE0NAK;
      break;

    case 4:
      priv->testmode = _USB_DCTL_TSTCTL_PACKET;
      break;

    case 5:
      priv->testmode = _USB_DCTL_TSTCTL_FORCE;
      break;

    default:
      usbtrace(TRACE_DEVERROR(EFM32_TRACEERR_BADTESTMODE), testmode);
      priv->dotest   = false;
      priv->testmode = _USB_DCTL_TSTCTL_DISABLE;
      priv->stalled  = true;
    }

  priv->dotest = true;
  efm32_ep0in_transmitzlp(priv);
}

/****************************************************************************
 * Name: efm32_ep0out_stdrequest
 *
 * Description:
 *   Handle a standard request on EP0.  Pick off the things of interest to
 *   the USB device controller driver; pass what is left to the class driver.
 *
 ****************************************************************************/

static inline void
efm32_ep0out_stdrequest(struct efm32_usbdev_s *priv,
                        struct efm32_ctrlreq_s *ctrlreq)
{
  struct efm32_ep_s *privep;

  /* Handle standard request */

  switch (ctrlreq->req)
    {
    case USB_REQ_GETSTATUS:
      {
        /* type:  device-to-host; recipient = device, interface, endpoint
         * value: 0
         * index: zero interface endpoint
         * len:   2; data = status
         */

        usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_GETSTATUS), 0);
        if (!priv->addressed ||
             ctrlreq->len != 2 ||
            USB_REQ_ISOUT(ctrlreq->type) ||
            ctrlreq->value != 0)
          {
            priv->stalled = true;
          }
        else
          {
            switch (ctrlreq->type & USB_REQ_RECIPIENT_MASK)
              {
              case USB_REQ_RECIPIENT_ENDPOINT:
                {
                  usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_EPGETSTATUS), 0);
                  privep = efm32_ep_findbyaddr(priv, ctrlreq->index);
                  if (!privep)
                    {
                      usbtrace(TRACE_DEVERROR(EFM32_TRACEERR_BADEPGETSTATUS),
                               0);
                      priv->stalled = true;
                    }
                  else
                    {
                      if (privep->stalled)
                        {
                          priv->ep0data[0] = (1 << USB_FEATURE_ENDPOINTHALT);
                        }
                      else
                        {
                          priv->ep0data[0] = 0; /* Not stalled */
                        }

                      priv->ep0data[1] = 0;
                      efm32_ep0in_setupresponse(priv, priv->ep0data, 2);
                    }
                }
                break;

