apache/nuttx/arch/arm/src/efm32/efm32_usbdev.c
      daint &= _USB_DAINT_INEPINT_MASK;
      epno = 0;

      while (daint)
        {
          if ((daint & 1) != 0)
            {
              uinfo("DIEPINT(%d) = %08x\n",
                    epno, efm32_getreg(EFM32_USB_DIEPINT(epno)));
              efm32_putreg(0xff, EFM32_USB_DIEPINT(epno));
            }

          epno++;
          daint >>= 1;
        }

      return;
    }

  /* Process each pending IN endpoint interrupt */

  epno = 0;
  while (daint)
    {
      /* Is an IN interrupt pending for this endpoint? */

      if ((daint & 1) != 0)
        {
          /* Get IN interrupt mask register.  Bits 0-6 correspond to enabled
           * interrupts as will be found in the DIEPINT interrupt status
           * register.
           */

          mask = efm32_getreg(EFM32_USB_DIEPMSK);

          /* Check if the TxFIFO not empty interrupt is enabled for this
           * endpoint in the DIEPMSK register.  Bits n corresponds to
           * endpoint n in the register. That condition corresponds to
           * bit 7 of the DIEPINT interrupt status register.  There is
           * no TXFE bit in the mask register, so we fake one here.
           */

          empty = efm32_getreg(EFM32_USB_DIEPEMPMSK);
          if ((empty & USB_DIEPEMPMSK(epno)) != 0)
            {
              mask |= USB_DIEPINT_TXFEMP;
            }

          /* Now, read the interrupt status and mask out all disabled
           * interrupts.
           */

          diepint = efm32_getreg(EFM32_USB_DIEPINT(epno)) & mask;

          /* Decode and process the enabled, pending interrupts */

          /* Transfer completed interrupt */

          if ((diepint & USB_DIEPINT_XFERCOMPL) != 0)
            {
              usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_EPIN_XFRC),
                       (uint16_t)diepint);

              /* It is possible that logic may be waiting for a the
               * TxFIFO to become empty.  We disable the TxFIFO empty
               * interrupt here; it will be re-enabled if there is still
               * insufficient space in the TxFIFO.
               */

              empty &= ~USB_DIEPEMPMSK(epno);
              efm32_putreg(empty, EFM32_USB_DIEPEMPMSK);
              efm32_putreg(USB_DIEPINT_XFERCOMPL, EFM32_USB_DIEPINT(epno));

              /* IN transfer complete */

              efm32_epin(priv, epno);
            }

          /* Timeout condition */

          if ((diepint & USB_DIEPINT_TIMEOUT) != 0)
            {
              usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_EPIN_TOC),
                      (uint16_t)diepint);
              efm32_putreg(USB_DIEPINT_TIMEOUT, EFM32_USB_DIEPINT(epno));
            }

          /* IN token received when TxFIFO is empty.
           * Applies to non-periodic IN endpoints only.
           * This interrupt indicates that an IN token was received
           * when the associated TxFIFO (periodic/non-periodic) was empty.
           * This interrupt is asserted on the endpoint for which the IN
           * token was received.
           */

          if ((diepint & USB_DIEPINT_INTKNTXFEMP) != 0)
            {
              usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_EPIN_ITTXFE),
                      (uint16_t)diepint);
              efm32_epin_request(priv, &priv->epin[epno]);
              efm32_putreg(USB_DIEPINT_INTKNTXFEMP, EFM32_USB_DIEPINT(epno));
            }

          /* IN endpoint NAK effective (ignored as this used only in polled
           * mode)
           */
#if 0
          if ((diepint & USB_DIEPINT_INEPNAKEFF) != 0)
            {
              usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_EPIN_INEPNE),
                      (uint16_t)diepint);
              efm32_putreg(USB_DIEPINT_INEPNAKEFF, EFM32_USB_DIEPINT(epno));
            }
#endif

          /* Endpoint disabled interrupt (ignored as this used only in polled
           * mode)
           */
#if 0
          if ((diepint & USB_DIEPINT_EPDISBLD) != 0)
            {
              usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_EPIN_EPDISD),
                      (uint16_t)diepint);
              efm32_putreg(USB_DIEPINT_EPDISBLD, EFM32_USB_DIEPINT(epno));
            }
#endif

          /* Transmit FIFO empty */

          if ((diepint & USB_DIEPINT_TXFEMP) != 0)
            {
              usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_EPIN_TXFE),
                      (uint16_t)diepint);

              /* If we were waiting for TxFIFO to become empty, the we might
               * have both XFRC and TXFE interrupts pending.  Since we do the
               * same thing for both cases, ignore the TXFE if we have
               * already processed the XFRC.
               */

              if ((diepint & USB_DIEPINT_XFERCOMPL) == 0)
                {
                  /* Mask further FIFO empty interrupts.  This will be
                   * re-enabled whenever we need to wait for a FIFO event.
                   */

                  empty &= ~USB_DIEPEMPMSK(epno);
                  efm32_putreg(empty, EFM32_USB_DIEPEMPMSK);

                  /* Handle TxFIFO empty */

                  efm32_epin_txfifoempty(priv, epno);
                }

              /* Clear the pending TxFIFO empty interrupt */

              efm32_putreg(USB_DIEPINT_TXFEMP, EFM32_USB_DIEPINT(epno));
            }
        }

      epno++;
      daint >>= 1;
    }
}

/****************************************************************************
 * Name: efm32_resumeinterrupt
 *
 * Description:
 *   Resume/remote wakeup detected interrupt
 *
 ****************************************************************************/

static inline void efm32_resumeinterrupt(struct efm32_usbdev_s *priv)
{
  uint32_t regval;

  /* Restart the PHY clock and un-gate USB core clock (HCLK) */

#ifdef CONFIG_USBDEV_LOWPOWER
  regval = efm32_getreg(EFM32_USB_PCGCCTL);
  regval &= ~(OTGFS_PCGCCTL_STPPCLK | OTGFS_PCGCCTL_GATEHCLK);
  efm32_putreg(regval, EFM32_USB_PCGCCTL);
#endif

  /* Clear remote wake-up signaling */

  regval  = efm32_getreg(EFM32_USB_DCTL);
  regval &= ~USB_DCTL_RMTWKUPSIG;
  efm32_putreg(regval, EFM32_USB_DCTL);

  /* Restore full power -- whatever that means for this particular board */

  efm32_usbsuspend((struct usbdev_s *)priv, true);

  /* Notify the class driver of the resume event */

