apache/nuttx/arch/arm/src/efm32/efm32_usbdev.c
  if (priv->driver)
    {
      CLASS_RESUME(priv->driver, &priv->usbdev);
    }
}

/****************************************************************************
 * Name: efm32_suspendinterrupt
 *
 * Description:
 *   USB suspend interrupt
 *
 ****************************************************************************/

static inline void efm32_suspendinterrupt(struct efm32_usbdev_s *priv)
{
#ifdef CONFIG_USBDEV_LOWPOWER
  uint32_t regval;
#endif

  /* Notify the class driver of the suspend event */

  if (priv->driver)
    {
      CLASS_SUSPEND(priv->driver, &priv->usbdev);
    }

#ifdef CONFIG_USBDEV_LOWPOWER
  /* USB_DSTS_SUSPSTS is set as long as the suspend condition is detected
   * on USB.  Check if we are still have the suspend condition, that we are
   * connected to the host, and that we have been configured.
   */

  regval = efm32_getreg(EFM32_USB_DSTS);

  if ((regval & USB_DSTS_SUSPSTS) != 0 && devstate == DEVSTATE_CONFIGURED)
    {
      /* Switch off OTG FS clocking.  Setting OTGFS_PCGCCTL_STPPCLK stops the
       * PHY clock.
       */

      regval = efm32_getreg(EFM32_USB_PCGCCTL);
      regval |= OTGFS_PCGCCTL_STPPCLK;
      efm32_putreg(regval, EFM32_USB_PCGCCTL);

      /* Setting OTGFS_PCGCCTL_GATEHCLK gate HCLK to modules other than
       * the AHB Slave and Master and wakeup logic.
       */

      regval |= OTGFS_PCGCCTL_GATEHCLK;
      efm32_putreg(regval, EFM32_USB_PCGCCTL);
    }
#endif

  /* Let the board-specific logic know that we have entered the suspend
   * state
   */

  efm32_usbsuspend((struct usbdev_s *)priv, false);
}

/****************************************************************************
 * Name: efm32_rxinterrupt
 *
 * Description:
 *   RxFIFO non-empty interrupt.  This interrupt indicates that there is at
 *   least one packet pending to be read from the RxFIFO.
 *
 ****************************************************************************/

static inline void efm32_rxinterrupt(struct efm32_usbdev_s *priv)
{
  struct efm32_ep_s *privep;
  uint32_t regval;
  int bcnt;
  int epphy;

  /* Disable the Rx status queue level interrupt */

  regval = efm32_getreg(EFM32_USB_GINTMSK);
  regval &= ~USB_GINTMSK_RXFLVLMSK;
  efm32_putreg(regval, EFM32_USB_GINTMSK);

  /* Get the status from the top of the FIFO */

  regval = efm32_getreg(EFM32_USB_GRXSTSP);

  /* Decode status fields */

  epphy  = (regval & _USB_GRXSTSP_CHEPNUM_MASK) >>
            _USB_GRXSTSP_CHEPNUM_SHIFT;
  privep = &priv->epout[epphy];

  /* Handle the RX event according to the packet status field */

  switch (regval & _USB_GRXSTSP_PKTSTS_MASK)
    {
    /* Global OUT NAK.  This indicate that the global OUT NAK bit has taken
     * effect.
     *
     * PKTSTS = Global OUT NAK, BCNT = 0, EPNUM = Don't Care, DPID = Don't
     * Care.
     */

    case USB_GRXSTSP_PKTSTS_GOUTNAK:
      {
        usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_OUTNAK), 0);
      }
      break;

    /* OUT data packet received.
     *
     * PKTSTS = DataOUT, BCNT = size of the received data OUT packet,
     * EPNUM = EPNUM on which the packet was received, DPID = Actual Data
     *         PID.
     */

    case USB_GRXSTSP_PKTSTS_PKTRCV:
      {
        usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_OUTRECVD), epphy);
        bcnt = (regval & _USB_GRXSTSP_BCNT_MASK) >> _USB_GRXSTSP_BCNT_SHIFT;
        if (bcnt > 0)
          {
            efm32_epout_receive(privep, bcnt);
          }
      }
      break;

    /* OUT transfer completed.  This indicates that an OUT data transfer for
     * the specified OUT endpoint has completed. After this entry is popped
     * from the receive FIFO, the core asserts a Transfer Completed interrupt
     * on the specified OUT endpoint.
     *
     * PKTSTS = Data OUT Transfer Done, BCNT = 0, EPNUM = OUT EP Num on
     * which the data transfer is complete, DPID = Don't Care.
     */

    case USB_GRXSTSP_PKTSTS_XFERCOMPL:
      {
        usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_OUTDONE), epphy);
      }
      break;

    /* SETUP transaction completed. This indicates that the Setup stage for
     * the specified endpoint has completed and the Data stage has started.
     * After this entry is popped from the receive FIFO, the core asserts a
     * Setup interrupt on the specified control OUT endpoint (triggers an
     * interrupt).
     *
     * PKTSTS = Setup Stage Done, BCNT = 0, EPNUM = Control EP Num,
     * DPID = Don't Care.
     */

    case USB_GRXSTSP_PKTSTS_SETUPCOMPL:
      {
        usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_SETUPDONE), epphy);
      }
      break;

    /* SETUP data packet received.
     * This indicates that a SETUP packet for the specified endpoint
     * is now available for reading from the receive FIFO.
     *
     * PKTSTS = SETUP, BCNT = 8, EPNUM = Control EP Num, DPID = D0.
     */

    case USB_GRXSTSP_PKTSTS_SETUPRCV:
      {
        uint16_t datlen;

        usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_SETUPRECVD), epphy);

        /* Read EP0 setup data.
         * NOTE:  If multiple SETUP packets are received,
         * the last one overwrites the previous setup packets and only that
         * last SETUP packet will be processed.
         */

        efm32_rxfifo_read(&priv->epout[EP0], (uint8_t *)&priv->ctrlreq,
                         USB_SIZEOF_CTRLREQ);

        /* Was this an IN or an OUT SETUP packet.  If it is an OUT SETUP,
         * then we need to wait for the completion of the data phase to
         * process the setup command.  If it is an IN SETUP packet, then
         * we must processing the command BEFORE we enter the DATA phase.
         *
         * If the data associated with the OUT SETUP packet is zero length,
         * then, of course, we don't need to wait.
         */

        datlen = GETUINT16(priv->ctrlreq.len);
        if (USB_REQ_ISOUT(priv->ctrlreq.type) && datlen > 0)
          {
            /* Clear NAKSTS so that we can receive the data */

            regval  = efm32_getreg(EFM32_USB_DOEP0CTL);
            regval |= USB_DOEP0CTL_CNAK;
            efm32_putreg(regval, EFM32_USB_DOEP0CTL);

            /* Wait for the data phase. */

            priv->ep0state = EP0STATE_SETUP_OUT;
          }
        else
          {
            /* We can process the setup data as soon as SETUP done word is
             * popped of the RxFIFO.
             */

