apache/nuttx/arch/arm/src/efm32/efm32_usbdev.c
            priv->ep0state = EP0STATE_SETUP_READY;
          }
      }
      break;

    default:
      {
        usbtrace(TRACE_DEVERROR(EFM32_TRACEERR_INVALIDPARMS),
                 (regval & _USB_GRXSTSP_PKTSTS_MASK) >>
                 _USB_GRXSTSP_PKTSTS_SHIFT);
      }
      break;
    }

  /* Enable the Rx Status Queue Level interrupt */

  regval  = efm32_getreg(EFM32_USB_GINTMSK);
  regval |= USB_GINTMSK_RXFLVLMSK;
  efm32_putreg(regval, EFM32_USB_GINTMSK);
}

/****************************************************************************
 * Name: efm32_enuminterrupt
 *
 * Description:
 *   Enumeration done interrupt
 *
 ****************************************************************************/

static inline void efm32_enuminterrupt(struct efm32_usbdev_s *priv)
{
  uint32_t regval;

  /* Activate EP0 */

  efm32_ep0in_activate();

  /* Set USB turn-around time for the full speed device with internal PHY
   * interface.
   */

  regval  = efm32_getreg(EFM32_USB_GUSBCFG);
  regval &= ~_USB_GUSBCFG_USBTRDTIM_MASK;
  regval |=  USB_GUSBCFG_USBTRDTIM(5);
  efm32_putreg(regval, EFM32_USB_GUSBCFG);
}

/****************************************************************************
 * Name: efm32_isocininterrupt
 *
 * Description:
 *   Incomplete isochronous IN transfer interrupt.  Assertion of the
 *   incomplete isochronous IN transfer interrupt indicates an incomplete
 *   isochronous IN transfer on at least one of the isochronous IN endpoints.
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_ISOCHRONOUS
static inline void efm32_isocininterrupt(struct efm32_usbdev_s *priv)
{
  int i;

  /* The application must read the endpoint control register for all
   * isochronous IN endpoints to detect endpoints with incomplete IN data
   * transfers.
   */

  for (i = 0; i < EFM32_NENDPOINTS; i++)
    {
      /* Is this an isochronous IN endpoint? */

      privep = &priv->epin[i];
      if (privep->eptype != USB_EP_ATTR_XFER_ISOC)
        {
          /* No... keep looking */

          continue;
        }

      /* Is there an active read request on the isochronous OUT endpoint? */

      if (!privep->active)
        {
          /* No.. the endpoint is not actively transmitting data */

          continue;
        }

      /* Check if this is the endpoint that had the incomplete transfer */

      regaddr = EFM32_USB_DIEPCTL(privep->epphy);
      doepctl = efm32_getreg(regaddr);
      dsts    = efm32_getreg(EFM32_USB_DSTS);

      /* EONUM = 0:even frame, 1:odd frame
       * SOFFN = Frame number of the received SOF
       */

      eonum = ((doepctl & USB_DIEPCTL_EONUM) != 0);
      soffn = ((dsts & _USB_DSTS_SOFFN_EVENODD_MASK) != 0);

      if (eonum != soffn)
        {
          /* Not this endpoint */

          continue;
        }

      /* For isochronous IN endpoints with incomplete transfers,
       * the application must discard the data in the memory and
       * disable the endpoint.
       */

      efm32_req_complete(privep, -EIO);
#warning "Will clear USB_DIEPCTL_USBACTEP too"
      efm32_epin_disable(privep);
      break;
    }
}
#endif

/****************************************************************************
 * Name: efm32_isocoutinterrupt
 *
 * Description:
 *   Incomplete periodic transfer interrupt
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_ISOCHRONOUS
static inline void efm32_isocoutinterrupt(struct efm32_usbdev_s *priv)
{
  struct efm32_ep_s *privep;
  struct efm32_req_s *privreq;
  uint32_t regaddr;
  uint32_t doepctl;
  uint32_t dsts;
  bool eonum;
  bool soffn;

  /* When it receives an IISOOXFR interrupt, the application must read the
   * control registers of all isochronous OUT endpoints to determine which
   * endpoints had an incomplete transfer in the current microframe. An
   * endpoint transfer is incomplete if both the following conditions are
   * true:
   *
   *   DOEPCTLx:EONUM = DSTS:SOFFN[0], and
   *   DOEPCTLx:EPENA = 1
   */

  for (i = 0; i < EFM32_NENDPOINTS; i++)
    {
      /* Is this an isochronous OUT endpoint? */

      privep = &priv->epout[i];
      if (privep->eptype != USB_EP_ATTR_XFER_ISOC)
        {
          /* No... keep looking */

          continue;
        }

      /* Is there an active read request on the isochronous OUT endpoint? */

      if (!privep->active)
        {
          /* No.. the endpoint is not actively transmitting data */

          continue;
        }

      /* Check if this is the endpoint that had the incomplete transfer */

      regaddr = EFM32_USB_DOEPCTL(privep->epphy);
      doepctl = efm32_getreg(regaddr);
      dsts    = efm32_getreg(EFM32_USB_DSTS);

      /* EONUM = 0:even frame, 1:odd frame
       * SOFFN = Frame number of the received SOF
       */

      eonum = ((doepctl & USB_DOEPCTL_EONUM) != 0);
      soffn = ((dsts & _USB_DSTS_SOFFN_EVENODD_MASK) != 0);

      if (eonum != soffn)
        {
          /* Not this endpoint */

          continue;
        }

      /* For isochronous OUT endpoints with incomplete transfers,
       * the application must discard the data in the memory and
       * disable the endpoint.
       */

      efm32_req_complete(privep, -EIO);
#warning "Will clear USB_DOEPCTL_USBACTEP too"
      efm32_epout_disable(privep);
      break;
    }
}
#endif

/****************************************************************************
 * Name: efm32_sessioninterrupt
 *
 * Description:
 *   Session request/new session detected interrupt
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_VBUSSENSING
static inline void efm32_sessioninterrupt(struct efm32_usbdev_s *priv)
{
#warning "Missing logic"
}
#endif

/****************************************************************************
 * Name: efm32_otginterrupt
 *
 * Description:
 *   OTG interrupt
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_VBUSSENSING
static inline void efm32_otginterrupt(struct efm32_usbdev_s *priv)
{
  uint32_t regval;

