apache/nuttx/arch/arm/src/efm32/efm32_usbdev.c
  /* Check for session end detected */

  regval = efm32_getreg(EFM32_USB_GOTGINT);
  if ((regval & OTGFS_GOTGINT_SEDET) != 0)
    {
#warning "Missing logic"
    }

  /* Clear OTG interrupt */

  efm32_putreg(retval, EFM32_USB_GOTGINT);
}
#endif

/****************************************************************************
 * Name: efm32_usbinterrupt
 *
 * Description:
 *   USB interrupt handler
 *
 ****************************************************************************/

static int efm32_usbinterrupt(int irq, void *context, void *arg)
{
  /* At present, there is only a single OTG FS device support. Hence it is
   * pre-allocated as g_otgfsdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct efm32_usbdev_s *priv = &g_otgfsdev;
  uint32_t regval;

  usbtrace(TRACE_INTENTRY(EFM32_TRACEINTID_USB), 0);

  /* Assure that we are in device mode */

  DEBUGASSERT((efm32_getreg(EFM32_USB_GINTSTS) & USB_GINTSTS_CURMOD) ==
              USB_GINTSTS_CURMOD_DEVICE);

  /* Get the state of all enabled interrupts.  We will do this repeatedly
   * some interrupts (like RXFLVL) will generate additional interrupting
   * events.
   */

  for (; ; )
    {
      /* Get the set of pending, un-masked interrupts */

      regval  = efm32_getreg(EFM32_USB_GINTSTS);
      regval &= efm32_getreg(EFM32_USB_GINTMSK);

      /* Break out of the loop when there are no further pending (and
       * unmasked) interrupts to be processes.
       */

      if (regval == 0)
        {
          break;
        }

      usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_INTPENDING),
              (uint16_t)regval);

      /* OUT endpoint interrupt. The core sets this bit to indicate that an
       * interrupt is pending on one of the OUT endpoints of the core.
       */

      if ((regval & USB_GINTSTS_OEPINT) != 0)
        {
          usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_EPOUT),
                  (uint16_t)regval);
          efm32_epout_interrupt(priv);
        }

      /* IN endpoint interrupt.  The core sets this bit to indicate that
       * an interrupt is pending on one of the IN endpoints of the core.
       */

      if ((regval & USB_GINTSTS_IEPINT) != 0)
        {
          usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_EPIN),
                  (uint16_t)regval);
          efm32_epin_interrupt(priv);
        }

      /* Host/device mode mismatch error interrupt */

#ifdef CONFIG_DEBUG_USB
      if ((regval & USB_GINTSTS_MODEMIS) != 0)
        {
          usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_MISMATCH),
                  (uint16_t)regval);
          efm32_putreg(USB_GINTSTS_MODEMIS, EFM32_USB_GINTSTS);
        }
#endif

      /* Resume/remote wakeup detected interrupt */

      if ((regval & USB_GINTSTS_WKUPINT) != 0)
        {
          usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_WAKEUP),
                  (uint16_t)regval);
          efm32_resumeinterrupt(priv);
          efm32_putreg(USB_GINTSTS_WKUPINT, EFM32_USB_GINTSTS);
        }

      /* USB suspend interrupt */

      if ((regval & USB_GINTSTS_USBSUSP) != 0)
        {
          usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_SUSPEND),
                  (uint16_t)regval);
          efm32_suspendinterrupt(priv);
          efm32_putreg(USB_GINTSTS_USBSUSP, EFM32_USB_GINTSTS);
        }

      /* Start of frame interrupt */

#ifdef CONFIG_USBDEV_SOFINTERRUPT
      if ((regval & USB_GINTSTS_SOF) != 0)
        {
          usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_SOF),
                  (uint16_t)regval);
          efm32_putreg(USB_GINTSTS_SOF, EFM32_USB_GINTSTS);
          usbdev_sof_irq(&priv->usbdev, efm32_getframe(&priv->usbdev));
        }
#endif

      /* RxFIFO non-empty interrupt.  Indicates that there is at least one
       * packet pending to be read from the RxFIFO.
       */

      if ((regval & USB_GINTSTS_RXFLVL) != 0)
        {
          usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_RXFIFO),
                  (uint16_t)regval);
          efm32_rxinterrupt(priv);
        }

      /* USB reset interrupt */

      if ((regval & USB_GINTSTS_USBRST) != 0)
        {
          usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_DEVRESET),
                  (uint16_t)regval);

          /* Perform the device reset */

          efm32_usbreset(priv);
          usbtrace(TRACE_INTEXIT(EFM32_TRACEINTID_USB), 0);
          efm32_putreg(USB_GINTSTS_USBRST, EFM32_USB_GINTSTS);
          return OK;
        }

      /* Enumeration done interrupt */

      if ((regval & USB_GINTSTS_ENUMDONE) != 0)
        {
          usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_ENUMDNE),
                  (uint16_t)regval);
          efm32_enuminterrupt(priv);
          efm32_putreg(USB_GINTSTS_ENUMDONE, EFM32_USB_GINTSTS);
        }

      /* Incomplete isochronous IN transfer interrupt.  When the core finds
       * non-empty any of the isochronous IN endpoint FIFOs scheduled for
       * the current frame non-empty, the core generates an IISOIXFR
       * interrupt.
       */

#ifdef CONFIG_USBDEV_ISOCHRONOUS
      if ((regval & USB_GINTSTS_IISOIXFR) != 0)
        {
          usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_IISOIXFR),
                  (uint16_t)regval);
          efm32_isocininterrupt(priv);
          efm32_putreg(USB_GINTSTS_IISOIXFR, EFM32_USB_GINTSTS);
        }

      /* Incomplete isochronous OUT transfer.  For isochronous OUT
       * endpoints, the XFRC interrupt may not always be asserted. If the
       * core drops isochronous OUT data packets, the application could fail
       * to detect the XFRC interrupt.  The incomplete Isochronous OUT data
       * interrupt indicates that an XFRC interrupt was not asserted on at
       * least one of the isochronous OUT endpoints. At this point, the
       * endpoint with the incomplete transfer remains enabled, but no active
       * transfers remain in progress on this endpoint on the USB.
       */

      if ((regval & USB_GINTSTS_IISOOXFR) != 0)
        {
          usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_IISOOXFR),
                  (uint16_t)regval);
          efm32_isocoutinterrupt(priv);
          efm32_putreg(USB_GINTSTS_IISOOXFR, EFM32_USB_GINTSTS);
        }
#endif

      /* Session request/new session detected interrupt */

#ifdef CONFIG_USBDEV_VBUSSENSING
      if ((regval & USB_GINTSTS_SESSREQINT) != 0)
        {
          usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_SRQ), (uint16_t)regval);
          efm32_sessioninterrupt(priv);
          efm32_putreg(USB_GINTSTS_SESSREQINT, EFM32_USB_GINTSTS);
        }

      /* OTG interrupt */

      if ((regval & USB_GINTSTS_OTGINT) != 0)
        {
          usbtrace(TRACE_INTDECODE(EFM32_TRACEINTID_OTG), (uint16_t)regval);
          efm32_otginterrupt(priv);
        }
#endif
    }

  usbtrace(TRACE_INTEXIT(EFM32_TRACEINTID_USB), 0);
  return OK;
}

/****************************************************************************
 * Endpoint operations
 ****************************************************************************/

/****************************************************************************
 * Name: efm32_enablegonak
 *
 * Description:
 *   Enable global OUT NAK mode
 *
 ****************************************************************************/

static void efm32_enablegonak(struct efm32_ep_s *privep)
{
  uint32_t regval;

