apache/nuttx/arch/arm/src/efm32/efm32_usbdev.c
  /* First, make sure that there is no GNOAKEFF interrupt pending. */

#if 0
  efm32_putreg(USB_GINTSTS_GONAKEFF, EFM32_USB_GINTSTS);
#endif

  /* Enable Global OUT NAK mode in the core. */

  regval = efm32_getreg(EFM32_USB_DCTL);
  regval |= USB_DCTL_SGOUTNAK;
  efm32_putreg(regval, EFM32_USB_DCTL);

#if 0
  /* Wait for the GONAKEFF interrupt that indicates that the OUT NAK
   * mode is in effect.  When the interrupt handler pops the OUTNAK word
   * from the RxFIFO, the core sets the GONAKEFF interrupt.
   */

  while ((efm32_getreg(EFM32_USB_GINTSTS) & USB_GINTSTS_GONAKEFF) == 0);
  efm32_putreg(USB_GINTSTS_GONAKEFF, EFM32_USB_GINTSTS);

#else
  /* Since we are in the interrupt handler, we cannot wait inline for the
   * GONAKEFF because it cannot occur until service th RXFLVL global
   * interrupt and pop the OUTNAK word from the RxFIFO.
   *
   * Perhaps it is sufficient to wait for Global OUT NAK status to be
   * reported in OTGFS DCTL register?
   */

  while ((efm32_getreg(EFM32_USB_DCTL) & USB_DCTL_GOUTNAKSTS) == 0);
#endif
}

/****************************************************************************
 * Name: efm32_disablegonak
 *
 * Description:
 *   Disable global OUT NAK mode
 *
 ****************************************************************************/

static void efm32_disablegonak(struct efm32_ep_s *privep)
{
  uint32_t regval;

  /* Set the "Clear the Global OUT NAK bit" to disable global OUT NAK mode */

  regval  = efm32_getreg(EFM32_USB_DCTL);
  regval |= USB_DCTL_CGOUTNAK;
  efm32_putreg(regval, EFM32_USB_DCTL);
}

/****************************************************************************
 * Name: efm32_epout_configure
 *
 * Description:
 *   Configure an OUT endpoint, making it usable
 *
 * Input Parameters:
 *   privep    - a pointer to an internal endpoint structure
 *   eptype    - The type of the endpoint
 *   maxpacket - The max packet size of the endpoint
 *
 ****************************************************************************/

static int efm32_epout_configure(struct efm32_ep_s *privep,
                                 uint8_t eptype,
                                 uint16_t maxpacket)
{
  uint32_t mpsiz;
  uint32_t regaddr;
  uint32_t regval;

  usbtrace(TRACE_EPCONFIGURE, privep->epphy);

  /* For EP0, the packet size is encoded */

  if (privep->epphy == EP0)
    {
      DEBUGASSERT(eptype == USB_EP_ATTR_XFER_CONTROL);

      /* Map the size in bytes to the encoded value in the register */

      switch (maxpacket)
        {
          case 8:
            mpsiz = USB_DOEP0CTL_MPS_8B;
            break;

          case 16:
            mpsiz = USB_DOEP0CTL_MPS_16B;
            break;

          case 32:
            mpsiz = USB_DOEP0CTL_MPS_32B;
            break;

          case 64:
            mpsiz = USB_DOEP0CTL_MPS_64B;
            break;

          default:
            uerr("ERROR: Unsupported maxpacket: %d\n", maxpacket);
            return -EINVAL;
        }
    }

  /* For other endpoints, the packet size is in bytes */

  else
    {
      mpsiz = (maxpacket << _USB_DOEPCTL_MPS_SHIFT);
    }

  /* If the endpoint is already active don't change the endpoint control
   * register.
   */

  regaddr = EFM32_USB_DOEPCTL(privep->epphy);
  regval  = efm32_getreg(regaddr);
  if ((regval & USB_DOEPCTL_USBACTEP) == 0)
    {
      if (regval & USB_DOEPCTL_NAKSTS)
        {
          regval |= USB_DOEPCTL_CNAK;
        }

      regval &= ~(_USB_DOEPCTL_MPS_MASK | _USB_DOEPCTL_EPTYPE_MASK);
      regval |= mpsiz;
      regval |= (eptype << _USB_DOEPCTL_EPTYPE_SHIFT);
      regval |= (USB_DOEPCTL_SETD0PIDEF | USB_DOEPCTL_USBACTEP);
      efm32_putreg(regval, regaddr);

      /* Save the endpoint configuration */

      privep->ep.maxpacket = maxpacket;
      privep->eptype       = eptype;
      privep->stalled      = false;
    }

  /* Enable the interrupt for this endpoint */

  regval = efm32_getreg(EFM32_USB_DAINTMSK);
  regval |= USB_DAINT_OUTEPINT(privep->epphy);
  efm32_putreg(regval, EFM32_USB_DAINTMSK);
  return OK;
}

/****************************************************************************
 * Name: efm32_epin_configure
 *
 * Description:
 *   Configure an IN endpoint, making it usable
 *
 * Input Parameters:
 *   privep    - a pointer to an internal endpoint structure
 *   eptype    - The type of the endpoint
 *   maxpacket - The max packet size of the endpoint
 *
 ****************************************************************************/

static int efm32_epin_configure(struct efm32_ep_s *privep,
                                uint8_t eptype,
                                uint16_t maxpacket)
{
  uint32_t mpsiz;
  uint32_t regaddr;
  uint32_t regval;

  usbtrace(TRACE_EPCONFIGURE, privep->epphy);

  /* For EP0, the packet size is encoded */

  if (privep->epphy == EP0)
    {
      DEBUGASSERT(eptype == USB_EP_ATTR_XFER_CONTROL);

      /* Map the size in bytes to the encoded value in the register */

      switch (maxpacket)
        {
          case 8:
            mpsiz = _USB_DIEP0CTL_MPS_8B;
            break;

          case 16:
            mpsiz = _USB_DIEP0CTL_MPS_16B;
            break;

          case 32:
            mpsiz = _USB_DIEP0CTL_MPS_32B;
            break;

          case 64:
            mpsiz = _USB_DIEP0CTL_MPS_64B;
            break;

          default:
            uerr("ERROR: Unsupported maxpacket: %d\n", maxpacket);
            return -EINVAL;
        }
    }

  /* For other endpoints, the packet size is in bytes */

  else
    {
      mpsiz = (maxpacket << _USB_DIEPCTL_MPS_SHIFT);
    }

  /* If the endpoint is already active don't change the endpoint control
   * register.
   */

  regaddr = EFM32_USB_DIEPCTL(privep->epphy);
  regval  = efm32_getreg(regaddr);
  if ((regval & USB_DIEPCTL_USBACTEP) == 0)
    {
      if (regval & USB_DIEPCTL_NAKSTS)
        {
          regval |= USB_DIEPCTL_CNAK;
        }

      regval &= ~(_USB_DIEPCTL_MPS_MASK | _USB_DIEPCTL_EPTYPE_MASK |
                  _USB_DIEPCTL_TXFNUM_MASK);
      regval |= mpsiz;
      regval |= (eptype << _USB_DIEPCTL_EPTYPE_SHIFT);
      regval |= (privep->epphy << _USB_DIEPCTL_TXFNUM_SHIFT);
      regval |= (USB_DIEPCTL_SETD0PIDEF | USB_DIEPCTL_USBACTEP);
      efm32_putreg(regval, regaddr);

      /* Save the endpoint configuration */

