apache/nuttx/arch/arm/src/efm32/efm32_usbdev.c
      privep->ep.maxpacket = maxpacket;
      privep->eptype       = eptype;
      privep->stalled      = false;
    }

  /* Enable the interrupt for this endpoint */

  regval = efm32_getreg(EFM32_USB_DAINTMSK);
  regval |= USB_DAINT_INEPINT(privep->epphy);
  efm32_putreg(regval, EFM32_USB_DAINTMSK);

  return OK;
}

/****************************************************************************
 * Name: efm32_ep_configure
 *
 * Description:
 *   Configure endpoint, making it usable
 *
 * Input Parameters:
 *   ep   - the struct usbdev_ep_s instance obtained from allocep()
 *   desc - A struct usb_epdesc_s instance describing the endpoint
 *   last - true if this this last endpoint to be configured.  Some hardware
 *          needs to take special action when all of the endpoints have been
 *          configured.
 *
 ****************************************************************************/

static int efm32_ep_configure(struct usbdev_ep_s *ep,
                              const struct usb_epdesc_s *desc,
                              bool last)
{
  struct efm32_ep_s *privep = (struct efm32_ep_s *)ep;
  uint16_t maxpacket;
  uint8_t  eptype;
  int ret;

  usbtrace(TRACE_EPCONFIGURE, privep->epphy);
  DEBUGASSERT(desc->addr == ep->eplog);

  /* Initialize EP capabilities */

  maxpacket = GETUINT16(desc->mxpacketsize);
  eptype    = desc->attr & USB_EP_ATTR_XFERTYPE_MASK;

  /* Setup Endpoint Control Register */

  if (privep->isin)
    {
      ret = efm32_epin_configure(privep, eptype, maxpacket);
    }
  else
    {
      ret = efm32_epout_configure(privep, eptype, maxpacket);
    }

  return ret;
}

/****************************************************************************
 * Name: efm32_ep0_configure
 *
 * Description:
 *   Reset Usb engine
 *
 ****************************************************************************/

static void efm32_ep0_configure(struct efm32_usbdev_s *priv)
{
  /* Enable EP0 IN and OUT */

  efm32_epin_configure(&priv->epin[EP0], USB_EP_ATTR_XFER_CONTROL,
                       CONFIG_USBDEV_EP0_MAXSIZE);
  efm32_epout_configure(&priv->epout[EP0], USB_EP_ATTR_XFER_CONTROL,
                        CONFIG_USBDEV_EP0_MAXSIZE);
}

/****************************************************************************
 * Name: efm32_epout_disable
 *
 * Description:
 *   Disable an OUT endpoint will no longer be used
 *
 ****************************************************************************/

static void efm32_epout_disable(struct efm32_ep_s *privep)
{
  uint32_t regaddr;
  uint32_t regval;
  irqstate_t flags;

  usbtrace(TRACE_EPDISABLE, privep->epphy);

  /* Is this an IN or an OUT endpoint */

  /* Before disabling any OUT endpoint, the application must enable
   * Global OUT NAK mode in the core.
   */

  flags = enter_critical_section();
  efm32_enablegonak(privep);

  /* Disable the required OUT endpoint by setting the EPDIS and SNAK bits
   * int DOECPTL register.
   */

  regaddr = EFM32_USB_DOEPCTL(privep->epphy);
  regval  = efm32_getreg(regaddr);
  regval &= ~USB_DOEPCTL_USBACTEP;
  regval |= (USB_DOEPCTL_EPDIS | USB_DOEPCTL_SNAK);
  efm32_putreg(regval, regaddr);

  /* Wait for the EPDISD interrupt which indicates that the OUT
   * endpoint is completely disabled.
   */

#if 0 /* Doesn't happen */
  regaddr = EFM32_USB_DOEPINT(privep->epphy);
  while ((efm32_getreg(regaddr) & USB_DOEPINT_EPDISBLD) == 0);
#else

  /* REVISIT: */

  up_udelay(10);
#endif

  /* Clear the EPDISD interrupt indication */

  efm32_putreg(USB_DOEPINT_EPDISBLD, EFM32_USB_DOEPINT(privep->epphy));

  /* Then disable the Global OUT NAK mode to continue receiving data
   * from other non-disabled OUT endpoints.
   */

  efm32_disablegonak(privep);

  /* Disable endpoint interrupts */

  regval  = efm32_getreg(EFM32_USB_DAINTMSK);
  regval &= ~USB_DAINT_OUTEPINT(privep->epphy);
  efm32_putreg(regval, EFM32_USB_DAINTMSK);

  /* Cancel any queued read requests */

  efm32_req_cancel(privep, -ESHUTDOWN);

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: efm32_epin_disable
 *
 * Description:
 *   Disable an IN endpoint when it will no longer be used
 *
 ****************************************************************************/

static void efm32_epin_disable(struct efm32_ep_s *privep)
{
  uint32_t regaddr;
  uint32_t regval;
  irqstate_t flags;

  usbtrace(TRACE_EPDISABLE, privep->epphy);

  /* After USB reset, the endpoint will already be deactivated by the
   * hardware. Trying to disable again will just hang in the wait.
   */

  regaddr = EFM32_USB_DIEPCTL(privep->epphy);
  regval  = efm32_getreg(regaddr);
  if ((regval & USB_DIEPCTL_USBACTEP) == 0)
    {
      return;
    }

  /* This INEPNE wait logic is suggested by reference manual, but seems
   * to get stuck to infinite loop.
   */

#if 0
  /* Make sure that there is no pending IPEPNE interrupt (because we are
   * to poll this bit below).
   */

  efm32_putreg(USB_DIEPINT_INEPNAKEFF, EFM32_USB_DIEPINT(privep->epphy));

  /* Set the endpoint in NAK mode */

  regaddr = EFM32_USB_DIEPCTL(privep->epphy);
  regval  = efm32_getreg(regaddr);
  regval &= ~USB_DIEPCTL_USBACTEP;
  regval |= (USB_DIEPCTL_EPDIS | USB_DIEPCTL_SNAK);
  efm32_putreg(regval, regaddr);

  /* Wait for the INEPNE interrupt that indicates that we are now in NAK
   * mode
   */

  regaddr = EFM32_USB_DIEPINT(privep->epphy);
  while ((efm32_getreg(regaddr) & USB_DIEPINT_INEPNAKEFF) == 0);

  /* Clear the INEPNE interrupt indication */

  efm32_putreg(USB_DIEPINT_INEPNAKEFF, regaddr);
#endif

  /* Deactivate and disable the endpoint by setting the EPDIS and SNAK bits
   * the DIEPCTLx register.
   */

  flags = enter_critical_section();
  regaddr = EFM32_USB_DIEPCTL(privep->epphy);
  regval  = efm32_getreg(regaddr);
  regval &= ~USB_DIEPCTL_USBACTEP;
  regval |= (USB_DIEPCTL_EPDIS | USB_DIEPCTL_SNAK);
  efm32_putreg(regval, regaddr);

  /* Wait for the EPDISD interrupt which indicates that the IN
   * endpoint is completely disabled.
   */

  regaddr = EFM32_USB_DIEPINT(privep->epphy);
  while ((efm32_getreg(regaddr) & USB_DIEPINT_EPDISBLD) == 0);

