apache/nuttx/arch/arm/src/efm32/efm32_usbdev.c
  /* Wait for 3 PHY Clocks */

  up_udelay(3);
  return OK;
}

/****************************************************************************
 * Name: efm32_rxfifo_flush
 *
 * Description:
 *   Flush the RX fifo.
 *
 ****************************************************************************/

static int efm32_rxfifo_flush(void)
{
  uint32_t regval;
  uint32_t timeout;

  /* Initiate the RX FIFO flush operation */

  efm32_putreg(USB_GRSTCTL_RXFFLSH, EFM32_USB_GRSTCTL);

  /* Wait for the FLUSH to complete */

  for (timeout = 0; timeout < EFM32_FLUSH_DELAY; timeout++)
    {
      regval = efm32_getreg(EFM32_USB_GRSTCTL);
      if ((regval & USB_GRSTCTL_RXFFLSH) == 0)
        {
          break;
        }
    }

  /* Wait for 3 PHY Clocks */

  up_udelay(3);
  return OK;
}

/****************************************************************************
 * Name: efm32_swinitialize
 *
 * Description:
 *   Initialize all driver data structures.
 *
 ****************************************************************************/

static void efm32_swinitialize(struct efm32_usbdev_s *priv)
{
  struct efm32_ep_s *privep;
  int i;

  /* Initialize the device state structure */

  memset(priv, 0, sizeof(struct efm32_usbdev_s));

  priv->usbdev.ops = &g_devops;
  priv->usbdev.ep0 = &priv->epin[EP0].ep;

  priv->epavail[0] = EFM32_EP_AVAILABLE;
  priv->epavail[1] = EFM32_EP_AVAILABLE;

  /* Initialize the endpoint lists */

  for (i = 0; i < EFM32_NENDPOINTS; i++)
    {
      /* Set endpoint operations, reference to driver structure (not
       * really necessary because there is only one controller), and
       * the physical endpoint number (which is just the index to the
       * endpoint).
       */

      privep           = &priv->epin[i];
      privep->ep.ops   = &g_epops;
      privep->dev      = priv;
      privep->isin     = 1;

      /* The index, i, is the physical endpoint address;  Map this
       * to a logical endpoint address usable by the class driver.
       */

      privep->epphy    = i;
      privep->ep.eplog = EFM32_EPPHYIN2LOG(i);

      /* Control until endpoint is activated */

      privep->eptype       = USB_EP_ATTR_XFER_CONTROL;
      privep->ep.maxpacket = CONFIG_USBDEV_EP0_MAXSIZE;
    }

  /* Initialize the endpoint lists */

  for (i = 0; i < EFM32_NENDPOINTS; i++)
    {
      /* Set endpoint operations, reference to driver structure (not
       * really necessary because there is only one controller), and
       * the physical endpoint number (which is just the index to the
       * endpoint).
       */

      privep           = &priv->epout[i];
      privep->ep.ops   = &g_epops;
      privep->dev      = priv;

      /* The index, i, is the physical endpoint address;  Map this
       * to a logical endpoint address usable by the class driver.
       */

      privep->epphy    = i;
      privep->ep.eplog = EFM32_EPPHYOUT2LOG(i);

      /* Control until endpoint is activated */

      privep->eptype       = USB_EP_ATTR_XFER_CONTROL;
      privep->ep.maxpacket = CONFIG_USBDEV_EP0_MAXSIZE;
    }
}

/****************************************************************************
 * Name: efm32_hwinitialize
 *
 * Description:
 *   Configure the OTG FS core for operation.
 *
 ****************************************************************************/

static void efm32_hwinitialize(struct efm32_usbdev_s *priv)
{
  uint32_t regval;
  uint32_t timeout;
  uint32_t address;
  int i;

  /* "The application must perform the following steps to initialize the
   *  core at device on, power on, or after a mode change from Host to
   * Device.
   *  1. Program the following fields in USB_DCFG register.
   *     - Device Speed
   *     - NonZero Length Status OUT Handshake
   *     - Periodic Frame Interval
   *  2. Program the USB_GINTMSK register to unmask the following interrupts.
   *     - USB Reset
   *     - Enumeration Done
   *     - Early Suspend
   *     - USB Suspend
   *  3. Wait for the USB_GINTSTS.USBRST interrupt, which indicates a reset
   *     has been detected on the USB and lasts for about 10 ms. On receiving
   *     this interrupt, the application must perform the steps listed in
   *     Initialization on USB Reset ...
   *  4. Wait for the USB_GINTSTS.ENUMDONE interrupt. This interrupt
   *     indicates the end of reset on the USB. On receiving this interrupt,
   *     the application must read the USB_DSTS register to determine the
   *     enumeration speed and perform the steps listed in Initialization
   *     on Enumeration Completion ..."
   *
   * "Initialization on USB Reset
   *  1. Set the NAK bit for all OUT endpoints
   *     - USB_DOEPx_CTL.SNAK = 1 (for all OUT endpoints)
   *  2. Unmask the following interrupt bits:
   *     - USB_USB_DAINTMSK.INEP0 = 1 (control 0 IN endpoint)
   *     - USB_USB_DAINTMSK.OUTEP0 = 1 (control 0 OUT endpoint)
   *     - USB_DOEPMSK.SETUP = 1
   *     - USB_DOEPMSK.XFERCOMPL = 1
   *     - USB_DIEPMSK.XFERCOMPL = 1
   *     - USB_DIEPMSK.TIMEOUTMSK = 1
   *  3. To transmit or receive data, the device must initialize more
   *     registers as specified in Device DMA/Slave Mode Initialization ...
   *  4. Set up the Data FIFO RAM for each of the FIFOs
   *     - Program the USB_GRXFSIZ Register, to be able to receive control
   *       OUT data and setup data. At a minimum, this must be equal to 1 max
   *       packet size of control endpoint 0 + 2 DWORDs (for the status of
   *       the control OUT data packet) + 10 DWORDs (for setup packets).
   *     - Program the Device IN Endpoint Transmit FIFO size register
   *       (depending on the FIFO number chosen), to be able to transmit
   *       control IN data. At a minimum, this must be equal to 1 max packet
   *       size of control endpoint 0.
   *  5. Program the following fields in the endpoint-specific registers for
   *     control OUT endpoint 0 to receive a SETUP packet
   *     - USB_DOEP0TSIZ.SUPCNT = 3 (to receive up to 3 back-to-back SETUP
   *       packets)
   *     - In DMA mode, USB_DOEP0DMAADDR register with a memory address to
   *       store any SETUP packets received"
   *
   * "Initialization on Enumeration Completion
   *  1. On the Enumeration Done interrupt (USB_GINTSTS.ENUMDONE, read the
   *     USB_DSTS register to determine the enumeration speed.
   *  2. Program the USB_DIEP0CTL.MPS field to set the maximum packet size.
   *     This step configures control endpoint 0. The maximum packet size
   *     for a control endpoint depends on the enumeration speed.
   *  3. In DMA mode, program the USB_DOEP0CTL register to enable control
   *     OUT endpoint 0, to receive a SETUP packet.
   *     - USB_DOEP0CTL.EPENA = 1"
   */

