apache/nuttx/arch/arm/src/efm32/efm32_usbdev.c
  /* First Turn on USB clocking */

  modifyreg32(EFM32_CMU_HFCORECLKEN0, 0,
              CMU_HFCORECLKEN0_USB | CMU_HFCORECLKEN0_USBC);

  /* At start-up the core is in FS mode. */

  /* Disable global interrupts by clearing the GINTMASK bit in the GAHBCFG
   * register; Set the TXFELVL bit in the GAHBCFG register so that TxFIFO
   * interrupts will occur when the TxFIFO is truly empty (not just half
   * full).
   */

  /* I never saw this in original EFM32 lib
   * and in reference manual I found:
   *    "Non-periodic TxFIFO Empty Level (can be enabled only when the core
   *    is operating in Slave mode as a host.)"
   */

  efm32_putreg(USB_GAHBCFG_NPTXFEMPLVL_EMPTY, EFM32_USB_GAHBCFG);

  /* efm32_putreg(0, EFM32_USB_GAHBCFG); */

  /* Enable PHY USB */

  efm32_putreg(USB_ROUTE_PHYPEN, EFM32_USB_ROUTE);

  /* Common USB OTG core initialization */

  /* Reset after a PHY select and set Host mode.  First, wait for AHB master
   * IDLE state.
   */

  for (timeout = 0; timeout < EFM32_READY_DELAY; timeout++)
    {
      up_udelay(3);
      regval = efm32_getreg(EFM32_USB_GRSTCTL);
      if ((regval & USB_GRSTCTL_AHBIDLE) != 0)
        {
          break;
        }
    }

  /* Then perform the core soft reset. */

  efm32_putreg(USB_GRSTCTL_CSFTRST, EFM32_USB_GRSTCTL);
  for (timeout = 0; timeout < EFM32_READY_DELAY; timeout++)
    {
      regval = efm32_getreg(EFM32_USB_GRSTCTL);
      if ((regval & USB_GRSTCTL_CSFTRST) == 0)
        {
          break;
        }
    }

  /* Wait for 3 PHY Clocks */

  up_udelay(3);

  /* Force Device Mode */

  regval  = efm32_getreg(EFM32_USB_GUSBCFG);
  regval &= ~(_USB_GUSBCFG_FORCEHSTMODE_MASK |
              _USB_GUSBCFG_CORRUPTTXPKT_MASK);
  regval |= USB_GUSBCFG_FORCEDEVMODE;
  efm32_putreg(regval, EFM32_USB_GUSBCFG);
  up_mdelay(50);

  /* Initialize device mode */

  /* Restart the PHY Clock */

  efm32_putreg(0, EFM32_USB_PCGCCTL);

  /* Device configuration register */

  regval  = efm32_getreg(EFM32_USB_DCFG);
  regval &= ~_USB_DCFG_PERFRINT_MASK;
  regval |= USB_DCFG_PERFRINT_80PCNT;
  efm32_putreg(regval, EFM32_USB_DCFG);

  /* Set full speed PHY */

  regval  = efm32_getreg(EFM32_USB_DCFG);
  regval &= ~_USB_DCFG_DEVSPD_MASK;
  regval |= USB_DCFG_DEVSPD_FS;
  efm32_putreg(regval, EFM32_USB_DCFG);

  /* Set Rx FIFO size */

  efm32_putreg(EFM32_RXFIFO_WORDS << _USB_GRXFSIZ_RXFDEP_SHIFT,
               EFM32_USB_GRXFSIZ);

  /* EP0 TX */

  address = EFM32_RXFIFO_WORDS;
  regval  = (address << _USB_DIEPTXF0_TXFSTADDR_SHIFT) |
            (EFM32_EP0_TXFIFO_WORDS << _USB_DIEPTXF0_TXFINEPTXF0DEP_SHIFT);
  efm32_putreg(regval, EFM32_USB_DIEPTXF0);

  /* EP1 TX */

  address += EFM32_EP0_TXFIFO_WORDS;
  regval   = (address << _USB_DIEPTXF1_INEPNTXFSTADDR_SHIFT) |
             (EFM32_EP1_TXFIFO_WORDS << _USB_DIEPTXF1_INEPNTXFDEP_SHIFT);
  efm32_putreg(regval, EFM32_USB_DIEPTXF1);

  /* EP2 TX */

  address += EFM32_EP1_TXFIFO_WORDS;
  regval   = (address << _USB_DIEPTXF2_INEPNTXFSTADDR_SHIFT) |
             (EFM32_EP2_TXFIFO_WORDS << _USB_DIEPTXF2_INEPNTXFDEP_SHIFT);
  efm32_putreg(regval, EFM32_USB_DIEPTXF2);

  /* EP3 TX */

  address += EFM32_EP2_TXFIFO_WORDS;
  regval   = (address << _USB_DIEPTXF3_INEPNTXFSTADDR_SHIFT) |
             (EFM32_EP3_TXFIFO_WORDS << _USB_DIEPTXF3_INEPNTXFDEP_SHIFT);
  efm32_putreg(regval, EFM32_USB_DIEPTXF3);

  /* Flush the FIFOs */

  efm32_txfifo_flush(USB_GRSTCTL_TXFNUM_FALL);
  efm32_rxfifo_flush();

  /* Clear all pending Device Interrupts */

  efm32_putreg(0, EFM32_USB_DIEPMSK);
  efm32_putreg(0, EFM32_USB_DOEPMSK);
  efm32_putreg(0, EFM32_USB_DIEPEMPMSK);
  efm32_putreg(0xffffffff, EFM32_USB_DAINT);
  efm32_putreg(0, EFM32_USB_DAINTMSK);

  /* Configure all IN endpoints */

  for (i = 0; i < EFM32_NENDPOINTS; i++)
    {
      regval = efm32_getreg(EFM32_USB_DIEPCTL(i));
      if ((regval & USB_DIEPCTL_EPENA) != 0)
        {
          /* The endpoint is already enabled */

          regval = USB_DIEPCTL_EPENA | USB_DIEPCTL_SNAK;
        }
      else
        {
          regval = 0;
        }

      efm32_putreg(regval, EFM32_USB_DIEPCTL(i));
      efm32_putreg(0, EFM32_USB_DIEPTSIZ(i));
      efm32_putreg(0xff, EFM32_USB_DIEPINT(i));
    }

  /* Configure all OUT endpoints */

  for (i = 0; i < EFM32_NENDPOINTS; i++)
    {
      regval = efm32_getreg(EFM32_USB_DOEPCTL(i));
      if ((regval & USB_DOEPCTL_EPENA) != 0)
        {
          /* The endpoint is already enabled */

          regval = USB_DOEPCTL_EPENA | USB_DOEPCTL_SNAK;
        }
      else
        {
          regval = 0;
        }

      efm32_putreg(regval, EFM32_USB_DOEPCTL(i));
      efm32_putreg(0, EFM32_USB_DOEPTSIZ(i));
      efm32_putreg(0xff, EFM32_USB_DOEPINT(i));
    }

  /* Disable all interrupts. */

  efm32_putreg(0, EFM32_USB_GINTMSK);

  /* Clear any pending USB_OTG Interrupts */

  efm32_putreg(0xffffffff, EFM32_USB_GOTGINT);

  /* Clear any pending interrupts */

  efm32_putreg(0xbfffffff, EFM32_USB_GINTSTS);

  /* Enable the interrupts in the INTMSK */

  regval  = (USB_GINTMSK_RXFLVLMSK | USB_GINTMSK_USBSUSPMSK |
             USB_GINTMSK_WKUPINTMSK | USB_GINTMSK_ENUMDONEMSK |
             USB_GINTMSK_IEPINTMSK | USB_GINTMSK_OEPINTMSK |
             USB_GINTMSK_USBRSTMSK);

#ifdef CONFIG_USBDEV_ISOCHRONOUS
  regval |= (USB_GINTMSK_INCOMPISOINMSK | USB_GINTMSK_INCOMPLPMSK);
#endif

#ifdef CONFIG_USBDEV_SOFINTERRUPT
  regval |= USB_GINTMSK_SOFMSK;
#endif

#ifdef CONFIG_USBDEV_VBUSSENSING
  regval |= (USB_GINTMSK_OTGINTMSK | USB_GINTMSK_SESSREQINTMSK);
#endif

#ifdef CONFIG_DEBUG_USB
  regval |= USB_GINTMSK_MODEMISMSK;
#endif

  efm32_putreg(regval, EFM32_USB_GINTMSK);

  /* Enable the USB global interrupt by setting GINTMSK in the global OTG
   * FS AHB configuration register; Set the TXFELVL bit in the GAHBCFG
   * register so that TxFIFO interrupts will occur when the TxFIFO is truly
   * empty (not just half full).
   */

  efm32_putreg(USB_GAHBCFG_GLBLINTRMSK | USB_GAHBCFG_NPTXFEMPLVL_EMPTY,
               EFM32_USB_GAHBCFG);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: arm_usbinitialize
 *
 * Description:
 *   Initialize USB hardware.
 *
 * Assumptions:
 * - This function is called very early in the initialization sequence
 * - PLL and GIO pin initialization is not performed here but should been in
 *   the low-level  boot logic:  PLL1 must be configured for operation at
 *   48MHz and P0.23 and PO.31 in PINSEL1 must be configured for Vbus and USB
 *   connect LED.
 *
 ****************************************************************************/

